# -*- coding: utf-8 -*-


import list_util
import re
import datetime
import random

term_str = "2021학년 1학기 중간고사" 

notice_str = term_str + " 시간표 및 고사실 안내" + "\n" + \
            "본인에게 해당되는 고사 및 고사실을 숙지하여 해당 고사실에 10분전 입실완료 바랍니다."

#salt = "Alaska02"
salt = "Wyoming"

# 아래 내용 수정
day_str_dict = { 
1: "제1일 (4월14일 수)", 
2: "제2일 (4월15일 목)", 
3: "제3일 (4월16일 금)", 
4: "제4일 (4월19일 월)", 
5: "제5일 (4월20일 화)" 
}

# 아래 내용 수정
day_day_dict = { 
1: "수",
2: "목", 
3: "금", 
4: "월", 
5: "화"
}

# 아래 내용 수정
date_day_list = "4월14일(수) 4월15일(목) 4월16일(금) 4월19일(월) 4월20일(화)".split() 




#time_periods = [ "1교시 2교시 3교시 4교시 5교시".split(), 
         #"08:30~09:50 10:10~11:00 11:20~13:00 13:30~14:50 15:10~16:00".split()]

#time_periods = [ "1교시 2교시 3교시 4교시 5교시".split(), 
         #"09:20~11:00 11:20~12:10 12:30~13:50 14:10~15:00 15:20~17:00".split()]

time_periods = [ "1교시 2교시 3교시 4교시".split(), 
         "08:30~09:50 10:10~11:00 11:20~13:00 14:00~13:40".split()]


period_starts = [ datetime.datetime(2001,1,1, 8, 30), datetime.datetime(2001,1,1, 10, 10),
                   datetime.datetime(2001,1,1, 11, 20), datetime.datetime(2001,1,1, 14, 0)]




period_lengths = [ 80, 50, 100, 100 ]  



message_template = "다음 URL 에서 자신의 수업시간표를 확인하기 바랍니다. http://url.savano.org/notice/NUMBER_CODE"

prefilled_link = "https://docs.google.com/forms/d/e/1FAIpQLSfvqbXk36Eie1sRBSga8zE0Jb1uQbn3PPcMhO9uTBNwMJ_PXA/viewform?usp=pp_url&entry.925729718=NUMBER&entry.356517579=CODE"

#message = "정수론 수업 Google Classroom 코드는  onnabjp  입니다. 등록한 후 자유게시판에 등록확인 답글을 올려주기 바랍니다." 
#message = "중간고사시간표 제1안을 보냅니다. 수정 후 월요일 오후에 과장, 부장 선생님들께 제2안을 발송할 예정입니다. 송원택 올림. http://url.savano.org/mid01fee"

#message = "안녕하세요. 기말고사 교과 담당 선생님 여러분께 기말고사시간표 제1안을 보냅니다. 오류 또는 수정요청사항이 있는 경우 12월4일까지 제게 알려주시기 바랍니다. 12월5일에 전학년 대상으로 오류여부확인을 할 계획입니다. 송원택 올림.   http://url.savano.org/finalonesheen"

message = "안녕하세요. 서울과학고등학교 교육과정부 송원택입니다. 2021학년 1학기 중 육아시간 사용 등 이유로 수업을 하실 수 없는 요일, 교시가 있다면 1월25일 월요일까지 제게 알려주시기 바랍니다. 송원택 올림." 

# 아래 내용 수정    # 김지우t 삭제
shuffled_teachers = re.split(r'\s+',
'''안민기t
여정필t
김봉준t
이승철t
도현진t
이미영t
조동근t
지우영t
배동일t
조현웅t
홍기만t
이일규t
전효성t
민정아t
임영나t
박은서t
정유선t
박재승t
장광재t
권상운t
송원택t
조미연t
최금뢰t
오미옥t
윤병일t
권용준t
김현호t
박차경t
김근유t
김경훈t
정관영t
조혜영t
이상민t
배종수t
박리원t
민진원t
조현태t
홍석민t
공윤주t
박새날t
정유정t
조현세t
노예솔t
최병철t
강영미t
이성도t
이슬t
남지애t
황광원t
김유정t
송경수t
유영주t
문세라t
백승용t
이경미t
박경희t
조영혜t
이현정t
김홍민t
김현기t
황성현t
김대범t
김상태t
윤상호t
오현선t
김지애t
서여민t
신수진t
성숙경t
박병기t
황성문t
변은지t
허진미t
박다솜t
박효숙t
최원근t''')





# 아래 내용 수정
ordered_exam_subjects = re.split(r'\s+', 
'''독서I
독서III
정치와법
세계문화지리
한국사
세계사
철학
영어I
영어소설
영어독해
중국어I
고체물리
창의융합특강VI/고체물리
창의융합특강X/분자분광학실습
창의융합특강XII/데이터와인공지능
수학I
수학III
기초통계학
미적분학I
미적분학II
선형대수학
물리학I
물리학III
고급물리학I
고급물리학II
화학I
화학III
고급화학II
생명과학I
생명과학III
고급생명과학II
지구과학I
지구과학III
컴퓨터과학I
객체지향프로그래밍''')



max_simul_num = 21 


exam_classrooms = re.split(r'\s+', 
'''수학강의실1
수학강의실2
수학강의실3
수학강의실4
수학강의실5
수학강의실6
수학강의실7
국어강의실1
국어강의실2
국어강의실3
우암공통강의실3
사회강의실3
사회강의실2
사회강의실1
우암공통강의실2
우암공통강의실1
우암공통강의실4
외국어강의실1
외국어강의실2
외국어강의실3
외국어강의실4
외국어강의실5''')

auto_bundle_classroom_dict = {
tuple("국어강의실1 국어강의실2 국어강의실3 사회강의실1 사회강의실2 사회강의실3 우암공통강의실3".split()): 
["국어강의실1 국어강의실2 국어강의실3".split(), "사회강의실1 사회강의실2".split(), "사회강의실3 우암공통강의실3".split()], 
tuple('수학강의실1 수학강의실2 수학강의실3 수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실1 수학강의실2 수학강의실3'.split(), '수학강의실4 수학강의실5'.split(), '수학강의실6 수학강의실7'.split()], 
tuple('수학강의실2 수학강의실3 수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실2 수학강의실3'.split(), '수학강의실4 수학강의실5'.split(), '수학강의실6 수학강의실7'.split()], 
tuple('우암공통강의실1 우암공통강의실2'.split()):['우암공통강의실1'.split(), '우암공통강의실2'.split() ], 
tuple("사회강의실1 사회강의실2 사회강의실3 우암공통강의실3".split()): 
    ["사회강의실1 사회강의실2".split(), "사회강의실3 우암공통강의실3".split()], 
tuple('수학강의실1'.split()): 
    ['수학강의실1'.split() ],
tuple("외국어강의실1 외국어강의실2 외국어강의실3 외국어강의실4".split()):
    ["외국어강의실1 외국어강의실2 외국어강의실3 외국어강의실4".split()]
}


bundle_classroom_dict = {
tuple('우암공통강의실4'.split()): ['우암공통강의실4'.split()], 
tuple('우암공통강의실1 우암공통강의실2'.split()):['우암공통강의실1'.split(), '우암공통강의실2'.split()],
tuple('수학강의실1 수학강의실2 수학강의실3 수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실1 수학강의실2 수학강의실3'.split(), '수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()], 
tuple("국어강의실1 국어강의실2 국어강의실3 사회강의실1 사회강의실2 사회강의실3 우암공통강의실3".split()): 
["국어강의실1 국어강의실2 국어강의실3".split(), "사회강의실1 사회강의실2 사회강의실3 우암공통강의실3".split()], 
tuple("사회강의실1 사회강의실2 사회강의실3 우암공통강의실3".split()): 
["사회강의실1 사회강의실2 사회강의실3 우암공통강의실3".split()], 
tuple("국어강의실1 국어강의실2 국어강의실3 우암공통강의실3".split()): 
["국어강의실1 국어강의실2 국어강의실3 우암공통강의실3".split()], 
tuple('수학강의실3 수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실3 수학강의실4'.split(), '수학강의실5 수학강의실6 수학강의실7'.split(),], 
tuple('수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실5 수학강의실6 수학강의실7'.split()], 
tuple('수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()], 
tuple('수학강의실2 수학강의실3 수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()): 
    ['수학강의실2 수학강의실3'.split(), '수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split()], 
tuple('수학강의실1 수학강의실2 수학강의실3 수학강의실4'.split()): 
    ['수학강의실1 수학강의실2 수학강의실3 수학강의실4'.split()], 
tuple('외국어강의실1 외국어강의실2 외국어강의실3 외국어강의실4 외국어강의실5'.split()):  
    ['외국어강의실1 외국어강의실2 외국어강의실3 외국어강의실4 외국어강의실5'.split()],
}


bundle_classrooms = [
'우암공통강의실1 우암공통강의실2'.split(),
'수학강의실1 수학강의실2 수학강의실3'.split(),
'수학강의실4 수학강의실5 수학강의실6 수학강의실7'.split(),
'국어강의실1 국어강의실2 국어강의실3'.split(),
'사회강의실1 사회강의실2 사회강의실3 우암공통강의실3'.split(),
'외국어강의실1 외국어강의실2 외국어강의실3 외국어강의실4 외국어강의실5'.split() ]

special_bundle_classrooms = [ 
'수학강의실1 수학강의실2 수학강의실3 수학강의실4'.split()
,'국어강의실1 국어강의실2 국어강의실3 우암공통강의실3'.split(),
'우암공통강의실1 우암공통강의실2'.split(),
]


bundle_classes = [
"생명과학실험II_1 생명과학실험II_2".split()
]

#svB_classes = "영어독해_1 영어독해_2".split()
#svC_classes = "세계사_1 세계사_2 세계사_3 세계사_4 세계사_5".split()

svB_classes = [ ] 
svC_classes = [ ] 
#svC_classes = "영어III_1 영어III_2 영어III_3 수리정보탐구_1 수리정보탐구_2 수리정보탐구_3 고급커뮤니케이션_1 고급커뮤니케이션_2 고급커뮤니케이션_3".split()
#svC_classes = re.split(r'\s+', 
#'''영어독해_1 영어독해_2 영어독해_3 영어독해_4 영어독해_5 영어독해_6 영어독해_7
#컴퓨터과학I_1 컴퓨터과학I_2 컴퓨터과학I_3 컴퓨터과학I_4 컴퓨터과학I_5 컴퓨터과학I_6 컴퓨터과학I_7 컴퓨터과학I_8''')

# 아래 내용 수정    # 조현웅 선생님도 여기에 들어가나요?
role_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''송원택t 교육과정부장
박은서t 고사
조혜영t 고사
조현웅t 안내방송
문세라t 방송
지우영t 교육과정부기획
최원근t 고사시간표 
백승용t 부장회의 
오현선t 부장회의 
송경수t 부장회의 
김근유t 부장회의 
이일규t 부장회의 
조영혜t 부장회의 
이경미t 부장회의 
최병철t 부장회의 
이성도t 부장회의 
정유선t 부장회의 
민진원t 부장회의 
윤상호t 부장회의'''), 2))


def add_unavailable_slots( update_dict ) : 
    for t_name in update_dict : 
        if t_name in unavailable_teacher_slots_dict : 
            unavailable_teacher_slots_dict[t_name].extend(update_dict[t_name])
        else : 
            unavailable_teacher_slots_dict[t_name] =  update_dict[t_name]


# 아래 내용 수정    # 조현웅 선생님도 여기에 들어가나요?
unavailable_teacher_slots_dict = {
"송원택t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)], 
"최원근t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
"조현웅t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
"조혜영t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
"박은서t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
"지우영t": [(1,1), (2,1), (3,1), (4,1), (5,1)],  
"문세라t": [(1,1), (1,2), (1,3), (5,1), (5,2), (5,3)],
"박효숙t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
}

# 최원근 편집
add_unavailable_slots( {
"백승용t": [(3, 1), (3, 2), (3, 3), (5, 3)],
"최병철t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
"황성문t": [(1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 3), 
            (3, 1), (3, 2), (3, 3), (4, 1), (4, 2), (4, 3), 
            (5, 1), (5, 2), (5, 3)],
"오현선t": [(2, 2), (2, 3)],
"전효성t": [(1,1), (2,1), (3,1), (4,1), (5,1)],
"최금뢰t": [(4, 2), (4, 3)],
"안민기t": [(1,1), (2,1), (3,1), (4,1), (5,1)],
"김유정t": [(4,1), (4,2), (4,3), (5,1), (5,2), (5,3)]
})

# 생활안전부 선생님은 월요일 1교시 빼주기(차량 지도)


# 아래 내용 수정
moderation_dict = {
"김유정t": 330,
"문세라t": 60 + 60,
"최병철t": 60 * 5, 
"백승용t": 60 * 1 + 30 * 1,
"조동근t": 65
}









# 부장 회의
add_unavailable_slots( {
"백승용t": [(2, 1)],
"송원택t": [(2, 1)],
"오현선t": [(2, 1)],
"송경수t": [(2, 1)],
"김근유t": [(2, 1)],
"이일규t": [(2, 1)],
"조영혜t": [(2, 1)],
"이경미t": [(2, 1)],
"최병철t": [(2, 1)],
"이성도t": [(2, 1)],
"정유선t": [(2, 1)],
"민진원t": [(2, 1)],
"윤상호t": [(2, 1)],
})




# 아래 내용 수정
aa_list = re.split(r'\s+',
'''정유선t 김경훈t 김현기t 남지애t 문세라t 박새날t 오미옥t 배동일t
민진원t 강영미t 박다솜t 박은서t 박재승t 변은지t 허진미t 황성문t
윤상호t 공윤주t 박경희t 이승철t 이현정t 조동근t 최원근t 박병기t'''
)



#======

hide_unavailable_slots =  {
#"변은지t": [  (2,1), (3,1), (4,1),  (6,1) ],
#"이경미t": [ (1,1), (2,1), (3,1), (4,1), (5,1), (6,1)],
#"강영미t": [ (1,1), (2,1), (3,1), (4,1), (5,1), (6,1) ],
}



# 아래 내용 수정
unavailable_sv_teachers_dict = {
"정감독": [ ], 
"부감독": [ ], 
"복도감독": "백승용t 최금뢰t".split() } 



# 아래 내용 수정
avoid_classes_dict = { 
"정유선t": "독서I_1 물리학I_1 생명과학I_1 수학I_1 영어I_1 정치와법_1 컴퓨터과학I_1 화학I_1".split(),
"김경훈t": "독서I_2 물리학I_2 생명과학I_2 수학I_2 영어I_2 정치와법_2 컴퓨터과학I_2 화학I_2".split(),
"김현기t": "독서I_3 물리학I_3 생명과학I_3 수학I_3 영어I_3 정치와법_3 컴퓨터과학I_3 화학I_3".split(),
"남지애t": "독서I_4 물리학I_4 생명과학I_4 수학I_4 영어I_4 정치와법_4 컴퓨터과학I_4 화학I_4".split(),
"문세라t": "독서I_5 물리학I_5 생명과학I_5 수학I_5 영어I_5 정치와법_5 컴퓨터과학I_5 화학I_5".split(),
"박새날t": "독서I_6 물리학I_6 생명과학I_6 수학I_6 영어I_6 정치와법_6 컴퓨터과학I_6 화학I_6".split(),
"오미옥t": "독서I_7 물리학I_7 생명과학I_7 수학I_7 영어I_7 정치와법_7 컴퓨터과학I_7 화학I_7".split(),
"배동일t": "독서I_8 물리학I_8 생명과학I_8 수학I_8 영어I_8 정치와법_8 컴퓨터과학I_8 화학I_8".split()
}

# 아래 내용 수정
first_year_advisors = [ "정유선t", "김경훈t", "김현기t", "남지애t", "문세라t", "박새날t", "오미옥t", "배동일t"]
second_year_advisors = "민진원t 강영미t 박다솜t 박은서t 박재승t 변은지t 허진미t 황성문t".split()
third_year_advisors = "윤상호t 공윤주t 박경희t 이승철t 이현정t 조동근t 최원근t 박병기t".split()


auto_subjects = re.split(r'\s+',
'''객체지향프로그래밍
고급물리학I
고급물리학II
고급화학II
물리학I
물리학III
미적분학I
미적분학II
창의융합특강VI/고체물리
창의융합특강X/분자분광학실습
창의융합특강XII/데이터와인공지능
컴퓨터과학I
화학I
화학III''')


# 아래 내용 수정
preassigned_pairs = dict(map( lambda x: ( (x[1], x[2]), x[0] ), 
list_util.partition( re.split(r'\s+',
'''민정아t 고급생명과학II_1 부감독
조미연t 고급화학II_1 정감독
윤상호t 미적분학I_1 정감독
정유선t 영어독해_1 정감독
이상민t 지구과학III_1 부감독
도현진t 창의융합특강VI/고체물리_1 정감독
김근유t 창의융합특강X/분자분광학실습_1 정감독'''), 3)))


shorthand_dict = dict( list_util.partition( 
re.split(r'\s+',
'''고급화학I 고화I
고급화학II 고화II
생명과학IV 생과IV
고급생명과학II 고생II 
고급생명과학I 고생I 
고급물리학II 고물II
창의융합특강XI/일반상대성이론 상대론
창의융합특강II/다체론 다체론
창의융합특강I/위상수학과곡면 위상
수리정보탐구 수정탐
영어독해 영독
고급지구과학 고지
창의융합특강VIII/Click-Clack-Chemistry 분자
창의융합특강VI/고체물리 고체
창의융합특강XII/데이터와인공지능 지능
창의융합특강XI/양자계산 양자계산'''), 2))

def shorten_by_dict(subj) : 
    if subj in shorthand_dict : 
        return shorthand_dict[subj]
    else : 
        return subj


flu_classroom_dict = {
#((2, 2), "중국어I_8") : "화학강의실1", 
#((1, 1), "수학III_10") : "화학강의실1", 
#((3, 3), "지구과학I_10") : "화학강의실1", 
#((5, 3), "기초통계학_10") : "화학강의실1", 
#((2, 3), "물리학III_9") : "화학강의실1", 
#((4, 3), "화학III_9") : "화학강의실1", 
#((1, 4), "한국사_5") : "화학강의실1"
}

flu_supervisor_dict = { 
#((2, 2), "중국어I_8", "정감독") : None,
#((1, 1), "수학III_10", "정감독") : None,
#((1, 4), "한국사_5", "정감독") : None
}


temp_added_time_dict = { 
"김지애t": -(60 * 5), 
"조영혜t": -(60 * 5)
}


# 아래 내용 수정
accumulated_time_dict = dict( map( lambda x: (x[0], int(x[1])), 
list_util.partition(re.split(r'\s+',
'''안민기t 0
여정필t 0
김봉준t 0
이승철t 0
도현진t 0
이미영t 0
조동근t 0
지우영t 0
배동일t 0
조현웅t 0
홍기만t 0
이일규t 0
전효성t 0
민정아t 0
임영나t 0
박은서t 0
정유선t 0
박재승t 0
장광재t 0
권상운t 0
송원택t 0
조미연t 0
최금뢰t 0
오미옥t 0
윤병일t 0
권용준t 0
김현호t 0
박차경t 0
김근유t 0
김경훈t 0
정관영t 0
조혜영t 0
이상민t 0
배종수t 0
박리원t 0
민진원t 0
조현태t 0
홍석민t 0
공윤주t 0
박새날t 0
정유정t 0
조현세t 0
노예솔t 0
최병철t 0
강영미t 0
이성도t 0
이슬t 0
남지애t 0
황광원t 0
김유정t 0
송경수t 0
유영주t 0
문세라t 0
백승용t 0
이경미t 0
박경희t 0
조영혜t 0
이현정t 0
김홍민t 0
김현기t 0
황성현t 0
김대범t 0
김상태t 0
윤상호t 0
오현선t 0
김지애t 0
서여민t 0
신수진t 0
성숙경t 0
박병기t 0
황성문t 0
변은지t 0
허진미t 0
박다솜t 0
박효숙t 0
최원근t 0'''), 2)))






pair_weights = { 
("미적분학I", "수학IV"): 218,
("물리학IV", "수학IV"): 96,
("수학IV", "지구과학II"): 91,
("물리학IV", "미적분학I"): 87,
("물리학II", "수학II"): 65,
("객체지향프로그래밍", "지구과학III"): 57,
("미적분학I", "지구과학II"): 45,
("객체지향프로그래밍", "수학IV"): 40,
("생명과학II", "융합과학"): 36,
("물리학II", "화학II"): 33,
("수학II", "컴퓨터과학II"): 30,
("세계사", "지구과학III"): 28,
("생명과학II", "화학II"): 27,
("세계사", "예술사"): 27,
("수학IV", "중국어II"): 27,
("생명과학II", "컴퓨터과학II"): 26,
("컴퓨터과학II", "화학II"): 25,
("물리학II", "컴퓨터과학II"): 22,
("수학II", "화학II"): 22,
("중국어II", "한국사"): 22,
("미적분학I", "중국어II"): 20,
("객체지향프로그래밍", "미적분학I"): 19,
("물리학IV", "지구과학II"): 19,
("융합과학", "화학II"): 19,
("객체지향프로그래밍", "세계사"): 18,
("생명과학II", "영어II"): 18,
("중국어II", "지구과학II"): 16,
("국어II", "수학II"): 15,
("생명과학IV", "지구과학II"): 15,
("고전문학", "철학"): 14,
("수학IV", "화학IV"): 14,
("융합과학", "컴퓨터과학II"): 14,
("지구과학II", "한국사"): 14,
("고급물리학I", "수학IV"): 13,
("객체지향프로그래밍", "고급화학II"): 12,
("고급물리학I", "물리학IV"): 12,
("고급물리학I", "미적분학I"): 12,
("미적분학II", "지구과학III"): 12,
("고급물리학II", "미적분학I"): 11,
("고급생명과학I", "생명과학IV"): 11,
("고급화학I", "수학IV"): 11,
("고급화학II", "지구과학III"): 11,
("문법", "영미문화탐구"): 11,
("물리학IV", "중국어II"): 11,
("고급물리학II", "수학IV"): 10,
("고급화학I", "화학IV"): 10,
("세계사", "시사영어"): 10,
("시사영어", "현대문학"): 10,
("객체지향프로그래밍", "지구과학II"): 9,
("고전문학", "지구과학II"): 9,
("과학사", "한국사"): 9,
("물리학II", "생명과학II"): 9,
("물리학II", "영어II"): 9,
("생명과학II", "정치경제"): 9,
("수학IV", "철학"): 9,
("지구과학II", "화학IV"): 9,
("고전문학", "세계사"): 8,
("미적분학I", "철학"): 8,
("미적분학II", "세계사"): 8,
("세계사", "지구과학II"): 8,
("수학II", "영어II"): 8,
("시사영어", "지구과학III"): 8,
("고급생명과학I", "지구과학II"): 7,
("고전문학", "과학사"): 7,
("객체지향프로그래밍", "문법"): 6,
("객체지향프로그래밍", "미적분학II"): 6,
("객체지향프로그래밍", "시사영어"): 6,
("고급물리학I", "중국어II"): 6,
("고급물리학II", "고급화학II"): 6,
("고급화학I", "미적분학II"): 6,
("고급화학II", "미적분학II"): 6,
("고급화학II", "세계사"): 6,
("고전문학", "영미문화탐구"): 6,
("고전문학", "지구과학III"): 6,
("미적분학I", "화학IV"): 6,
("수학II", "융합과학"): 6,
("시사영어", "예술사"): 6,
("영어II", "화학II"): 6,
("예술사", "지구과학II"): 6,
("융합과학", "정치경제"): 6,
("중국어II", "철학"): 6,
("중국어II", "커뮤니케이션"): 6,
("객체지향프로그래밍", "예술사"): 5,
("객체지향프로그래밍", "현대문학"): 5,
("고급물리학II", "지구과학II"): 5,
("고급화학II", "고전문학"): 5,
("고급화학II", "지구과학II"): 5,
("국어II", "물리학II"): 5,
("문법", "지구과학III"): 5,
("물리학IV", "미적분학II"): 5,
("생명과학II", "세계문화지리"): 5,
("세계사", "현대문학"): 5,
("시사영어", "영어독해"): 5,
("영어II", "융합과학"): 5,
("지구과학II", "철학"): 5,
("객체지향프로그래밍", "한국사"): 4,
("고급물리학I", "지구과학II"): 4,
("고전문학", "수학IV"): 4,
("고전문학", "화학IV"): 4,
("국어II", "영어II"): 4,
("국어II", "융합과학"): 4,
("문법", "세계사"): 4,
("미적분학II", "수학IV"): 4,
("미적분학II", "예술사"): 4,
("수학II", "정치경제"): 4,
("수학IV", "시사영어"): 4,
("영미문화탐구", "지구과학II"): 4,
("지구과학III", "현대문학"): 4,
("철학", "커뮤니케이션"): 4,
("고전문학", "미적분학II"): 3,
("과학사", "세계사"): 3,
("과학사", "시사영어"): 3,
("과학사", "지구과학II"): 3,
("문법", "지구과학II"): 3,
("물리학II", "수학IV"): 3,
("생명과학IV", "중국어II"): 3,
("정치경제", "화학II"): 3,
("고급생명과학I", "수학IV"): 2,
("고급화학I", "지구과학II"): 2,
("과학사", "지구과학III"): 2,
("국어II", "세계문화지리"): 2,
("물리학II", "융합과학"): 2,
("미적분학I", "영미문화탐구"): 2,
("미적분학II", "지구과학II"): 2,
("미적분학II", "현대문학"): 2,
("수학IV", "한국사"): 2 
}

first_third_avoid_teachers = re.split(r'\s+',
""
)


consec_avoid_teachers = re.split(r'\s+',
"")


avoid_teacher_pairs = list_util.partition( re.split(r'\s+',
'''김근유t 박새날t 
김근유t 오현선t
지우영t 오현선t
이경미t 오현선t'''), 2)


