# -*- coding: utf-8 -*-

import re
import list_util, gen_util, xlsx_util
import os
import pickle
import openpyxl.utils


dept_names = [ "국어", "사회", "외국어", "수학", "물리", "화학", "생명과학", 
                "지구과학", "정보", "예체능" ] 

semester_str = "2022학년 1학기" 
semester_prefix = "2022_1_" 

semester_list = re.split(r'\s+', 
'''2021_1 2021_summer 2021_2 2021_winter 
2022_1 2022_summer 2022_2 2022_winter
2023_1 2023_summer 2023_2 2023_winter
2024_1 2024_summer 2024_2 2024_winter''') 

current_semester_index = 6

next_semester_str = "2022학년 2학기" 
next_semester_prefix = "2022_2_" 




#salt = "Wyoming"
#salt = "California"
#salt = "Alaska"
#salt = "Florida"
salt = "Louisiana"

bujang_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''101A 정유선
102A 박경희
103A 서여민
104A 정유정
105A 김현호
106A 이슬
107A 노예솔
108A 배동일
201A 황성문
202A 문세라
203A 김대범
204A 김봉준
205A 박은서
206A 조동근
207A 유영주
208A 박재승
301A 윤상호
302A 조혜영
303A 임영나
304A 정관영
305A 김연희
306A 이상민
307A 도현진
308A 이승철
교무기획 백승용
교육과정 송원택
연구 성숙경
입학관리 노창균
생활안전 송경수
과학창의 조현태
과학문화 이일규
인성계발 박병기
국제교류 신수진
의행관운영 최병철
1학년 정유선
2학년 황성문
3학년 윤상호'''), 2 ))



name_department_dict = dict( map(lambda c: (c[1],c[0]),  
list_util.partition( 
re.split(r'\s+', 
'''국어 강영미t
국어 최경미t
국어 박경희t
국어 임영나t
국어 조영혜t
국어 조혜영t
사회 이한슬t
사회 김경훈t
사회 황광원t
사회 조동근t
사회 허진미t
외국어 공윤주t
외국어 윤근식t
외국어 신수진t
외국어 박리원t
외국어 이미영t
외국어 홍기만t
외국어 정유선t
수학 홍석민t
수학 노예솔t
수학 김유정t
수학 김지애t
수학 김현기t
수학 최병철t
수학 양동규t
수학 송원택t
수학 오미옥t
수학 유영주t
수학 윤상호t
수학 이승철t
수학 조현웅t
수학 노창균t
수학 황성문t
물리 김상태t 
물리 황윤준t
물리 도현진t
물리 배동일t
물리 박재승t 
물리 권용준t
물리 안민기t
물리 김태윤t
물리 이현정t
물리 전효성t
물리 문세라t
화학 김근유t
화학 이준호t
화학 박은서t
화학 성숙경t
화학 김현호t
화학 정관영t
화학 조미연t
화학 지우영t
화학 최원근t
생물 김봉준t
생물 백승용t
생물 배종수t
생물 정예은t
생물 이일규t
생물 민정아t
생물 이슬t
생물 서여민t
지구과학 여정필t
지구과학 고동현t
지구과학 이상민t
지구과학 이성도t
지구과학 조현태t
지구과학 황성현t
정보 김연희t
정보 박다솜t
정보 박병기t
정보 문기보t
정보 장광재t
예체능 변은지t
예체능 송경수t
예체능 김대범t
예체능 정유정t
보건상담 박효숙t
보건상담 최금뢰t''' 
), 2 )))

ordered_departments = re.split(r'\s+', 
'''국어
사회
수학
물리
화학
생물
지구과학
정보
외국어
예체능
보건상담''')

baedangpyo_ordered_departments = re.split(r'\s+', 
'''국어
사회
외국어
수학
수학/정보
공통
물리
화학
생물
지구과학
정보
예체능
보건상담''')


name_team_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''백승용t 교무기획부
강영미t 교무기획부
김현기t 교무기획부
정예은t 교무기획부
박다솜t 교무기획부
김연희t 교무기획부
문기보t 교무기획부
조미연t 교무기획부
송원택t 교육과정부
지우영t 교육과정부
최원근t 교육과정부
김현호t 교육과정부
이슬t 교육과정부
최경미t 교육과정부
이한슬t 교육과정부
성숙경t 연구부
이성도t 연구부
허진미t 연구부
김지애t 연구부
조동근t 연구부
송경수t 생활안전부
김대범t 생활안전부
홍석민t 생활안전부
공윤주t 생활안전부
김경훈t 생활안전부
박효숙t 생활안전부
조현태t 과학창의부
오미옥t 과학창의부
김근유t 과학창의부
김상태t 과학창의부
조현웅t 과학창의부
권용준t 과학창의부
여정필t 과학창의부
노예솔t 과학창의부
이상민t 과학창의부
이일규t 과학문화부
전효성t 과학문화부
김봉준t 과학문화부
이현정t 과학문화부
문세라t 과학문화부
서여민t 과학문화부
장광재t 과학문화부
이준호t 과학문화부
노창균t 입학관리부
배종수t 입학관리부
정관영t 입학관리부
황윤준t 입학관리부
황성현t 입학관리부
박병기t 인성계발부
김유정t 인성계발부
최금뢰t 인성계발부
정유정t 인성계발부
황광원t 인성계발부
조영혜t 인성계발부
변은지t 인성계발부
박정은t 인성계발부
신수진t 국제교류부
박리원t 국제교류부
안민기t 국제교류부
이미영t 국제교류부
홍기만t 국제교류부
고동현t 국제교류부
박은서t 국제교류부
양동규t 국제교류부
민정아t 국제교류부
최병철t 의행관운영부
윤근식t 의행관운영부
김태윤t 의행관운영부
조혜영t 의행관운영부
이현경t 의행관운영부
양신규t 의행관운영부
정유선t 1학년부
배동일t 1학년부
박경희t 1학년부
황성문t 2학년부
박재승t 2학년부
유영주t 2학년부
윤상호t 3학년부
이승철t 3학년부
도현진t 3학년부
임영나t 3학년부
기과철t 연구부'''), 2 ))





junior_subjects = { }


junior_subjects["2021_1"] = re.split(r'\s+', 
'''건강과체육I
국어I
독서I
물리학I
미술I
생명과학I
세계문화지리
수학I
영어I
영어회화I
융합과학탐구
정치와법
컴퓨터과학I
화학I''')


junior_subjects["2021_2"]= re.split(r'\s+', 
'''건강과체육II
국어II
독서II
물리학II
미술II
생명과학II
세계문화지리
수학II
영어II
영어회화II
정치와법
지구과학I
컴퓨터과학II
화학II''')

junior_subjects["2022_1"] = re.split(r'\s+', 
'''건강과체육I
국어I
물리학I
미술I
생명과학I
수학I
영어I
영어회화I
융합과학탐구
컴퓨터과학I
화학I''')

junior_subjects["2022_2"]= re.split(r'\s+', 
'''건강과체육II
국어II
물리학II
미술II
생명과학II
수학II
영어II
영어회화II
지구과학I
컴퓨터과학II
화학II''')


junior_subjects["2023_1"] = junior_subjects["2022_1"] 
junior_subjects["2023_2"] = junior_subjects["2022_2"] 


subject_name_conv = { }


exp_subjects = re.split(r'\s+', 
'''물리학실험II 생명과학실험II 화학실험II
물리학실험I 생명과학실험I 화학실험I
물리학실험 생명과학실험 화학실험 지구과학실험
고급물리학실험 고급생명과학실험 고급화학실험 고급지구과학실험''')



assistant_subjects = \
     ("컴퓨터과학II 물리학실험II 객체지향프로그래밍 " + \
        "화학실험II 건강과체육II 여가와체육II 생활체육" + \
          " 영어회화II 고급커뮤니케이션 커뮤니케이션").split()



default_assistant_part_pairs = [ ]


classroom_sharing_pairs = [ ( "건강과체육I", "여가와체육I", "생활체육"  ), 
        ( "건강과체육II", "여가와체육II", "생활체육"  ), 
        ("영어회화I", "커뮤니케이션" ),
                             ("영어회화II", "커뮤니케이션" ) ] 


all_classrooms = \
    ( "물리강의실1 사회강의실1 사회강의실2 사회강의실3" + \
" 생물실험실2 생물실험실1 화학강의실1 화학강의실2 수학강의실3" + \
" 정보강의실 물리실험실1 외국어강의실5 외국어강의실4 외국어강의실3" + \
" 외국어강의실2 외국어강의실1 화학강의실3 수학강의실6 수학강의실4" + \
" 수학강의실5 수학강의실2 음악실 수학강의실1 생물강의실1" + \
" 컴퓨터실2 국어강의실3 국어강의실2 국어강의실1 미술실" + \
" 생물강의실2 컴퓨터실1 우암공통강의실2 우암공통강의실3 우암공통강의실1" + \
" 화학실험실1 물리강의실2 지구과학강의실2" + \
" 수학강의실7 물리실험실3 물리실험실2 지구과학실험실1 지구과학실험실2 " + \
" 생물실험실3 화학실험실2 화학RnE실" + \
" 융합과학실 상상토의실" + \
" 우암공통강의실4 대회의실" + \
" 지구과학강의실1 소회의실 체육관" ).split()

all_classrooms.sort()



default_classroom_assignments_subject = { 
"커뮤니케이션": "외국어강의실5"
, "영어회화I": "외국어강의실5"
, "고급커뮤니케이션": "외국어강의실5",
"융합과학탐구": "융합과학실/물리실험실3/생물실험실3/화학RnE실",
"물리학실험II": "물리실험실1",
"물리학실험I": "물리실험실1",
"물리학실험": "물리실험실1",
"로봇공학기초실습I": "물리실험실2",
"화학실험": "화학실험실2",
"생명과학실험II": "생물실험실1",
"생명과학실험I": "생물실험실1",
"생명과학실험": "생물실험실1",
"고급생명과학II": "생물실험실3",
"컴퓨터과학프로젝트": "정보강의실",
"창의융합특강XII/데이터와인공지능": "컴퓨터실2",
"자료구조": "상상토의실",
"컴퓨터과학II": "컴퓨터실1",
"컴퓨터과학I": "컴퓨터실1",
"건강과체육II": "체육관",
"건강과체육I": "체육관",
"여가와체육II": "체육관",
"여가와체육I": "체육관",
"생활체육": "체육관",
"고급화학II": "화학강의실3",
"창의융합특강VIII/Click-Clack-Chemistry": "화학강의실3", 
"고급화학I": "화학강의실2",
"음악I": "음악실" 
, "음악II": "음악실" 
, "예술사": "미술실/음악실" 
, "생활미술": "미술실" 
, "생활음악": "음악실" 
, "중국어I": "외국어강의실2"
, "중국어II": "외국어강의실2"
, "미술II": "미술실" 
, "미술I": "미술실" 
, "부장회의": "소회의실" }

default_classroom_assignments_class = {
"화학실험I_1": "화학실험실1",
"화학실험I_2": "화학실험실1",
"화학실험I_3": "화학실험실1",
"화학실험I_4": "화학실험실1",
"화학실험I_5": "화학실험실1",
"화학실험I_6": "화학실험실1",
"화학실험I_7": "화학실험실1",
"화학실험I_8": "화학실험실1",
"화학실험I_9": "화학실험실1",
"화학실험I_10": "화학실험실2",
}

default_classroom_assignments_part = {
#"객체지향프로그래밍_1$1": "정보강의실",
#"객체지향프로그래밍_1$2": "컴퓨터실2",
#"객체지향프로그래밍_1$3": "컴퓨터실2",
}

sub_group_names = ["국어", "사회", "수학", "공통", "물리", "화학",
                    "생물", "지구과학", "정보", "영어", "중국어", "음악",
                        "미술", "예술", "체육", "보건상담"]



classroom_shorthand = {
"국어강의실1":"국강1", 
"국어강의실2":"국강2", 
"국어강의실3":"국강3", 
"물리강의실1":"물강1", 
"물리강의실2":"물강2", 
"물리실험실1":"물실1", 
"물리실험실2":"물실2", 
"물리실험실3":"물실3", 
"물리RnE실":"물리RnE", 
"미술실":"미술실", 
"사회강의실1":"사강1", 
"사회강의실2":"사강2", 
"사회강의실3":"사강3", 
"생물강의실1":"생강1", 
"생물강의실2":"생강2", 
"생물실험실1":"생실1", 
"생물실험실2":"생실2", 
"생물실험실3":"생실3", 
"소회의실":"소회의실", 
"대회의실":"대회의실", 
"수학강의실1":"수강1", 
"수학강의실2":"수강2", 
"수학강의실3":"수강3", 
"수학강의실4":"수강4", 
"수학강의실5":"수강5", 
"수학강의실6":"수강6", 
"수학강의실7":"수강7", 
"외국어강의실1":"외강1", 
"외국어강의실2":"외강2", 
"외국어강의실3":"외강3", 
"외국어강의실4":"외강4", 
"외국어강의실5":"외강5", 
"우암공통강의실1":"우공1", 
"우암공통강의실2":"우공2", 
"우암공통강의실3":"우공3", 
"우암공통강의실4":"우공4", 
"음악실":"음악실", 
"정보강의실":"정보강", 
"지구과학강의실1":"지강1", 
"지구과학강의실2":"지강2", 
"지구과학실험실1":"지실1", 
"지구과학실험실2":"지실2", 
"체육관":"체육관", 
"컴퓨터실1":"컴실1", 
"컴퓨터실2":"컴실2", 
"상상토의실":"상상실", 
"화학RnE실":"화학RnE", 
"화학강의실1":"화강1", 
"화학강의실2":"화강2", 
"화학강의실3":"화강3", 
"화학실험실1":"화실1", 
"화학실험실2":"화실2", 
"미술실/음악실":"미/음",
"음악실/미술실":"음/미",
"융합과학실":"융과실" , 
"융합과학실/생물실험실3/화학RnE실":"해당실험실", 
"융합과학실/물리실험실3/생물실험실3/화학RnE실":"해당실험실", 
None: "None"
}


ban_list =  re.split(r'\s+', 
'''1-1 1-2 1-3 1-4 1-5 1-6 1-7 1-8
2-1 2-2 2-3 2-4 2-5 2-6 2-7 2-8
3-1 3-2 3-3 3-4 3-5 3-6 3-7 3-8''')

sen_ban_list = re.split(r'\s+', '''3-1 3-2 3-3 3-4 3-5 3-6 3-7 3-8''')



absent_students = "".split()

subject_dept = {
'국어II': '국어',
'국어I': '국어',
'독서II': '국어',
'독서I': '국어',
'독서III': '국어',
'독서IV': '국어',
'매체언어비평': '국어',
'문법': '국어',
'고전문학': '국어',
'현대문학': '국어',
'세계사': '사회',
'세계문화지리': '사회',
'정치경제': '사회',
'정치와법': '사회',
'철학': '사회',
'한국사': '사회',
'커뮤니케이션': '외국어',
'고급커뮤니케이션': '외국어',
'영어II': '외국어',
'영어I': '외국어',
'시사영어': '외국어',
'영어독해': '외국어',
'영어회화II': '외국어',
'영어회화I': '외국어',
'영미문화탐구': '외국어',
'중국어II': '외국어',
'중국어I': '외국어',
'미적분학I': '수학',
'미적분학II': '수학',
'수학II': '수학',
'수학I': '수학',
'수학III': '수학',
'수학IV': '수학',
'정수론': '수학',
'기초통계학': '수학',
'융합과학탐구': '공통',
'융합과학': '공통',
'고급물리학II': '물리',
'고급물리학I': '물리',
'과학사': '물리',
'물리학II': '물리',
'물리학I': '물리',
'물리학III': '물리',
'물리학IV': '물리',
'물리학실험II': '물리',
'물리학실험I': '물리',
'고급화학I': '화학',
'고급화학II': '화학',
'화학실험II': '화학',
'화학실험I': '화학',
'화학II': '화학',
'화학I': '화학',
'화학III': '화학',
'화학IV': '화학',
'고급생명과학I': '생물',
'고급생명과학II': '생물',
'생명과학실험II': '생물',
'생명과학실험I': '생물',
'생명과학II': '생물',
'생명과학I': '생물',
'생명과학III': '생물',
'생명과학IV': '생물',
'지구과학II': '지구과학',
'지구과학I': '지구과학',
'고급지구과학': '지구과학',
'지구과학III': '지구과학',
'객체지향프로그래밍': '정보',
'컴퓨터과학II': '정보',
'컴퓨터과학프로젝트': '정보',
'컴퓨터과학I': '정보',
'미술II': '예체능',
'미술I': '예체능',
'예술사': '예체능',
'음악II': '예체능',
'음악I': '예체능',
'건강과체육II': '예체능',
'건강과체육I': '예체능',
'생활체육': '예체능',
'여가와체육II': '예체능',
'여가와체육I': '예체능',
'보건/진로': '보건상담',
"창의융합특강IX/광학광물학실습": "지구과학", 
"창의융합특강VIII/수치해석탐구": "수학", 
"창의융합특강X/분자분광학실습": "화학", 
"창의융합특강XI/양자계산": "물리", 
"창의융합특강IV/일반상대성이론": "물리", 
"창의융합특강I/위상수학과곡면": "수학", 
"창의융합특강II/다체론": "물리", 
"창의융합특강V/UnityGameProgramming": "정보", 
"창의융합특강VII/데이터와인공지능": "정보", 
"창의융합특강XII/데이터와인공지능": "정보", 
"창의융합특강XIII/수학논문작성실습": "수학", 
"창의융합특강VIII/Click-Clack-Chemistry": "화학", 
"창의융합특강VIII/분자건축": "화학", 
"창의융합특강IV/최신화학연구논문읽기": "화학", 
'창의융합특강XIX/생물정보학과파이썬': "화학", 
'창의융합특강XVII/화학논문작성실습': "화학", 
"생활미술": "예체능",
"생활음악": "예체능",
"선형대수학": "수학",
"영어소설": "영어",
"영작문": "영어",
"자료구조": "정보",
"작문": "국어",
"창의융합특강V/추상대수학I": "수학",
"창의융합특강VI/고체물리": "물리",
"창의융합특강VII/파이썬분석화학": "화학",
'경제학': '사회',
'로봇공학기초실습I': '물리',
'물리학실험': '물리',
'양자정보특강I/양자계산': '수학',
'창의융합특강XVIII/최신화학연구논문읽기': '화학',
'창의융합특강XXIV/과학사': '지구과학',
'창의융합특강XXV/과학철학': '사회',
'천문학실습': '지구과학',
'화학실험': '화학',
}



skip_subject_list = "부장회의 과장회의 담임업무 교감연수 육아시간".split()

#skip_subject_list.extend( ('''금륙 금오 금일 목륙 목오 목일 목칠 수일 월륙 월사 월삼 월오 ''' + 
        #''' 월이 월일 월칠 화륙 화사 화삼 화오 화이 화일 화칠''').split())

avoid_series = [ "월1 월2 월3",
"월2 월3 월4",
"월5 월6 월7",
"화1 화2 화3",
"화2 화3 화4",
"화5 화6 화7",
"수1 수2 수3",
"수2 수3 수4",
"수5 수6 수7",
"목1 목2 목3",
"목2 목3 목4",
"목5 목6 목7",
"금1 금2 금3",
"금2 금3 금4",
"금5 금6 금7"]

sec_avoid_series = [ "월1 월2 월3 월4",
"월4 월5 월6 월7",
"화1 화2 화3 화4",
"화4 화5 화6 화7",
"수1 수2 수3 수4",
"수4 수5 수6 수7",
"목1 목2 목3 목4",
"목4 목5 목6 목7",
"금1 금2 금3 금4",
"금4 금5 금6 금7"]



shorthands = { 
"객체지향프로그래밍": "객지"
,"건강과체육II": "건체"
,"여가와체육II": "옃이"
,"고급물리학II": "고물"
,"고급생명과학I": "고생"
,"고급지구과학": "고지"
,"고급화학II": "고화"
,"고전문학": "고문"
#,"과학사": "과사"
,"국어II": "국어"
,"독서II": "독이"
,"독서IV": "독사"
,"문법": "문법"
,"물리학II": "물투"
,"물리학IV": "물포"
,"물리학실험II": "밀이"
,"미술II": "미술"
,"미적분학I": "적원"
,"미적분학II": "적투"
,"생명과학II": "생투"
,"생명과학IV": "생포"
,"생명과학실험II": "샐투"
,"생명과학실험I": "생실"
,"생활체육": "생체"
,"세계문화지리": "지리"
,"세계사": "세사"
,"수학II": "수투"
,"수학IV": "수포"
,"시사영어": "시영"
,"영미문화탐구": "영미"
,"영어II": "영어"
,"영어독해": "영독"
,"예술사": "예사"
,"예술사": "예사"
,"융합과학탐구": "융탐"
,"음악II": "음악"
,"정수론": "수론"
,"정치경제": "정경"
,"정치와법": "정법"
,"중국어II": "중이"
,"지구과학II": "지투"
,"지구과학III": "지삼"
,"철학": "철학"
,"커뮤니케이션": "커뮤"
,"컴퓨터과학II": "컴과"
,"한국사": "한사"
,"현대문학": "현문"
,"화학II": "화투"
,"화학IV": "화포"
,"화학실험II": "활이"
,"부장회의": "회의"
,"과장회의": "회의"
,"담임업무": "___/"
,"육아시간": "___/"
,"매체언어비평": "매평"
}

shorthands.update( {
"객체지향프로그래밍": "객지"
,"건강과체육I": "건칠"
,"고급물리학I": "골일"
,"고급물리학II": "골이"
,"고급생명과학II": "공이"
,"고급커뮤니케이션": "고커"
,"고급화학I": "괗일"
,"고급화학II": "괗이"
#,"과학사": "과사"
,"국어I": "국일"
,"기초통계학": "기통"
,"독서I": "독일"
,"독서III": "독삼"
,"매체언어비평": "매평"
,"물리학I": "물일"
,"물리학III": "물삼"
,"물리학실험I": "밀일"
,"미술I": "미술"
,"미적분학I": "믹일"
,"미적분학II": "믹이"
,"보건/진로": "보건"
,"생명과학I": "생일"
,"생명과학III": "생삼"
,"생명과학실험I": "생실"
,"생활미술": "생미"
,"생활음악": "생음"
,"생활체육": "생체"
,"선형대수학": "선대"
,"세계문화지리": "지리"
,"세계사": "세사"
,"수리정보탐구": "수정"
,"수학I": "수일"
,"수학III": "수삼"
,"여가와체육I": "체일"
,"영어I": "영일"
,"영어III": "영삼"
,"영어독해": "영독"
,"영어회화I": "영회"
,"영어회화II": "영회"
,"영작문": "영작"
,"융합과학": "융과"
,"융합과학탐구": "융탐"
,"음악I": "음일"
,"자료구조": "자료"
,"작문": "작문"
,"정수론": "수론"
,"정치경제": "정경"
,"중국어I": "중어"
,"지구과학I": "지일"
,"지구과학II": "지투"
,"지구과학III": "지삼"
,"철학": "철학"
,"컴퓨터과학I": "컴길"
,"한국사": "한사"
,"현대문학": "현문"
,"화학I": "화일"
,"화학III": "화삼"
,"화학실험I": "활일"
,"영어소설": "영소" 
} )


shorthands.update( {
"창의융합특강IX/광학광물학실습": "특구", 
"창의융합특강VIII/수치해석탐구": "특팔", 
"창의융합특강X/분자분광학실습": "분광", 
"창의융합특강XI/양자계산": "양자", 
"창의융합특강IV/일반상대성이론": "특사", 
"창의융합특강IV/수학논문작성법": "논작", 
"창의융합특강I/위상수학과곡면": "위상", 
"창의융합특강II/다체론": "다체", 
"창의융합특강V/UnityGameProgramming": "게임", 
"창의융합특강VI/고체물리": "고체", 
"창의융합특강XII/데이터와인공지능": "지능", 
"창의융합특강VIII/Click-Clack-Chemistry": "클릭", 
"창의융합특강VIII/분자건축": "분건", 
"창의융합특강VII/파이썬분석화학": "파화", 
"창의융합특강IV/최신화학연구논문읽기": "화읽", 
"창의융합특강V/추상대수학I": "대수", 
'창의융합특강XIII/수학논문작성실습': "수논", 
'창의융합특강XIX/생물정보학과파이썬':"생정", 
'창의융합특강XVII/화학논문작성실습': "화논", 
'컴퓨터과학프로젝트':"컴프"
})

shorthands.update( {
"경제학": "경제",
"로봇공학기초실습I": "로일",
"물리학실험": "물실",
"양자정보특강I/양자계산": "양산",
"창의융합특강XVIII/최신화학연구논문읽기": "화연",
"창의융합특강XXIV/과학사": "과사",
"창의융합특강XXV/과학철학": "과철",
"천문학실습": "천문",
"화학실험": "화실"
})



weekly_table_shortening = {
"창의융합특강IX/광학광물학실습": "특강IX/광물학", 
"창의융합특강VIII/수치해석탐구": "특강VIII/수해탐", 
"창의융합특강X/분자분광학실습": "특강X/분광학", 
"창의융합특강XI/양자계산": "특강XI/양자산",
"양자정보특강I/양자계산": "양정특I/양자산",
"창의융합특강IV/일반상대성이론": "특강IV/상대론",
"창의융합특강V/UnityGameProgramming": "특강V/Unity", 
"창의융합특강VIII/Click-Clack-Chemistry":  "특강VIII/Click-Clack", 
"창의융합특강VIII/분자건축":  "특강VIII/분자건축", 
"창의융합특강VII/데이터와인공지능":  "특강VII/인공지능", 
"창의융합특강XII/데이터와인공지능":  "특강XII/인공지능", 
"컴퓨터과학프로젝트":  "컴과프로젝트", 
"창의융합특강I/위상수학과곡면": "특강I/위상", 
"창의융합특강II/다체론":  "특강II/다체론", 
"창의융합특강VI/고체물리":  "특강VI/고체", 
"창의융합특강IV/수학논문작성법":  "특강IV/논작", 
"창의융합특강XIII/수학논문작성실습":  "특강XIII/수논작", 
"창의융합특강XVII/화학논문작성실습":  "특강XVII/화논작", 
"창의융합특강XIX/생물정보학과파이썬":  "특강XIX/생물정보학", 
"창의융합특강VII/파이썬분석화학": "특강VII/파이썬화학", 
"창의융합특강IV/최신화학연구논문읽기": "특강IV/화학논문", 
"창의융합특강V/추상대수학I": "특강V/대수학",
"창의융합특강XXV/과학철학":  "특강XXV/과학철학", 
"창의융합특강XVIII/최신화학연구논문읽기":"특강XVIII/화연논", 
"창의융합특강XXIV/과학사": "특강XXIV/과학사", 
"과학사(1)\n지구과학강의실": "과학사(1) 지강",
"과학사(2)\n지구과학강의실": "과학사(2) 지강",
"과학사(3)\n지구과학강의실": "과학사(3) 지강",
"과학철학(1)\n사": "과학철학(1) 사",
"과학철학(2)\n사": "과학철학(2) 사",
"과학철학(3)\n사": "과학철학(3) 사",
#"외국어강의실5/융합공통강의실": "외강5/융공강",
#"커뮤니케이션": "커뮤니케" ,
"고급커뮤니케이션": "고급커뮤니케" ,
"객체지향프로그래밍": "객체지향프로",
"컴퓨터실2/": "컴실2/",
"정보강의실/": "정보강/",
"실습I(1)\n물": "실습I(1) 물",
"실습I(2)\n물": "실습I(2) 물",
"실습I(3)\n물": "실습I(3) 물",
"능(1)\n정보강의실": "능(1) 정보강의실",
"능(2)\n정보강의실": "능(2) 정보강의실",
"능(1)\n컴": "능(1) 컴",
"능(2)\n화": "능(3) 화",
"능(3)\n컴": "능(3) 컴",
#"건축(1)\n사회": "건축(1) 사회",
"보학(1)\n생물": "보학(1) 생물",
"보학(2)\n생물": "보학(2) 생물",
"논문(1)\n우암공통강의실3": "논문(1) 우공강3",
"연논(1)\n우암공통강의실3": "연논(1) 우공강3",
"건축(1)\n우암공통강의실2": "건축(1) 우공강2",
"수학(1)\n수학강의실": "수학(1) 수강",
"/컴퓨터실2": "/컴실2",
"융합과학탐구": "융탐",
"\n융합과학실/생물실험실3/화학RnE실":
"융과실/생실3/화RnE"
,"\n융합과학실/물리실험실3/생물실험실3/화학RnE실":
"융과실/물실3/생실3/화RnE"
}



shorthands.update( {
"금륙": "___/",
"금오": "___/",
"금일": "___/",
"목륙": "___/",
"목오": "___/",
"목일": "___/",
"목칠": "___/",
"수일": "___/",
"월륙": "___/",
"월사": "___/",
"월삼": "___/",
"월오": "___/",
"월이": "___/",
"월일": "___/",
"월칠": "___/",
"화륙": "___/",
"화사": "___/",
"화삼": "___/",
"화오": "___/",
"화이": "___/",
"화일": "___/",
"화칠": "___/",
})

shorthands.update( {
"특별고사1": "특별",
"특별고사2": "특별",
"특별고사3": "특별",
"특별고사4": "특별",
"특별고사5": "특별",
"특별고사6": "특별",
"특별고사7": "특별",
"특별고사8": "특별",
"특별고사9": "특별",
"특별고사10": "특별",
"특별고사11": "특별",
"특별고사12": "특별",
"특별고사13": "특별",
"특별고사14": "특별",
"특별고사15": "특별",
"특별고사16": "특별",
"특별고사17": "특별",
"특별고사18": "특별",
"특별고사19": "특별",
})


korean_digits = "공 일 이 삼 사 오 륙 칠 팔 구 열".split()
korean_gabja = "갑 을 병 정 무 기 경 신 임 계 은".split()
korean_surnames = "강 김 민 박 송 이 장 조 차 한 홍".split()



hours_dict = {
"객체지향프로그래밍": 3,
"건강과체육I": 1,
"건강과체육II": 1,
"경영학": 2,
"경제학": 2,
"고급물리학I": 3,
"고급물리학II": 3,
"고급생명과학I": 3,
"고급생명과학II": 3,
"고급지구과학": 3,
"고급지구과학I": 3,
"고급커뮤니케이션": 3,
"고급화학I": 3,
"고급화학II": 3,
"고전문학": 2,
"과학사": 2,
#"국어I": 2,
#"국어II": 2,
"기초통계학": 3,
#"독서I": 1,
#"독서II": 1,
"독서III": 1,
"독서IV": 1,
"디자인": 2,
"매체언어비평": 2,
"문법": 2,
"물리학I": 3,
"물리학II": 3,
"물리학III": 4,
"물리학IV": 3,
"물리학실험I": 2,
"물리학실험II": 2,
"미술I": 1,
"미술II": 1,
"미적분학I": 4,
"미적분학II": 4,
"생명과학I": 3,
"생명과학II": 3,
"생명과학III": 3,
"생명과학IV": 3,
"생명과학실험I": 2,
"생명과학실험II": 2,
"생활미술": 2,
"생활음악": 2,
"생활체육": 2,
"선형대수학": 3,
"세계문화지리": 3,
"세계사": 3,
"수리정보탐구": 2,
"수학I": 4,
"수학II": 4,
"수학III": 3,
"수학IV": 4,
"시사영어": 3,
"여가와체육I": 1,
"여가와체육II": 1,
"영미문화탐구": 2,
"영어I": 3,
"영어II": 3,
"영어III": 3,
"영어독해": 3,
"영어소설": 3,
"영어회화I": 1,
"영어회화II": 1,
"영작문": 3,
"예술사": 2,
"융합과학탐구": 3,
"음악I": 1,
"음악II": 1,
"자료구조": 3,
"작문": 2,
"정수론": 3,
"정치경제": 3,
"중국어I": 2,
"중국어II": 2,
"지구과학I": 3,
"지구과학II": 3,
"지구과학III": 3,
"창의융합특강I": 2,
"창의융합특강I/위상수학과곡면": 2,
"창의융합특강II": 2,
"창의융합특강II/다체론": 2,
"창의융합특강III": 2,
"창의융합특강III/전산물리학": 2,
"창의융합특강IV": 2,
"창의융합특강IV/최신화학연구논문읽기": 2, 
"창의융합특강IV/수학논문작성법": 2,
"창의융합특강IV/일반상대성이론": 2,
"창의융합특강IX": 2,
"창의융합특강IX/광학광물학실습": 2,
"창의융합특강V": 2,
"창의융합특강V/UnityGameProgramming": 2,
"창의융합특강VI": 2,
"창의융합특강VI/고체물리": 2,
"창의융합특강VI/미분방정식과응용": 2,
"창의융합특강VII": 2,
"창의융합특강VIII": 2,
"창의융합특강VIII/수치해석탐구": 2,
"창의융합특강X": 2,
"창의융합특강XI": 2,
"창의융합특강XII": 2,
"창의융합특강XX": 2,
"창의융합특강VIII/분자건축": 2,
"창의융합특강V/추상대수학I": 2,
"창의융합특강XII/데이터와인공지능": 2,
"창의융합특강IV/최신화학연구논문읽기": 2,
"창의융합특강VII/파이썬분석화학": 2,
"창의융합특강X/분자분광학실습": 2,
"창의융합특강IX/광학광물학실습": 2,
"창의융합특강XIII": 2,
"창의융합특강XIV": 2,
"창의융합특강XIX": 2,
"창의융합특강XV": 2,
"창의융합특강XVI": 2,
"창의융합특강XVII": 2,
"창의융합특강XVIII": 2,
"창의융합특강XXI": 2,
"창의융합특강XXII": 2,
"창의융합특강XXIII": 2,
"천문학실습": 2,
"철학": 3,
"커뮤니케이션": 2,
#"컴퓨터과학I": 2,
"컴퓨터과학II": 2,
"컴퓨터과학프로젝트": 3,
"한국사": 3,
"한국사/철학": 3,
"현대문학": 2,
"화학I": 3,
"화학II": 3,
"화학III": 4,
"화학IV": 3,
"화학실험I": 2,
"화학실험II": 2,
"고급물리학실험": 2,
"고급생명과학실험": 2,
"고급지구과학II": 3,
"고급프로그래밍": 3,
"고급화학실험": 2,
"로봇공학기초실습": 2,
"물리학실험": 2,
"생명과학실험": 2,
"세계사특강": 2,
"양자역학": 3,
"양자정보특강I": 2,
"양자정보특강II": 2,
"양자정보특강III": 2,
"양자정보특강IV": 2,
"인공지능": 3,
"정치와법": 3,
"화학실험": 2,
"융합과학": 3,
"부장회의": 1,
"담임업무": 0,
"보건/진로": 1,
"과장회의": 1,
"교감연수": 0,
"육아시간": 0,
"창의융합연구I": 2,
"창의융합연구II": 2,
}


hours_dict.update({
"창의융합특강VIII/수치해석탐구": 2,
"창의융합특강XI/양자계산": 2,
"창의융합특강IV/일반상대성이론": 2,
"창의융합특강IV/수학논문작성법": 2,
"창의융합특강I/위상수학과곡면": 2,
"창의융합특강II/다체론": 2,
"창의융합특강V/UnityGameProgramming": 2,
"창의융합특강VI/고체물리": 2,
"창의융합특강VIII/Click-Clack-Chemistry": 2,
"창의융합특강VIII/분자건축": 2,
"창의융합특강VIII/분자건축": 2, 
"창의융합특강V/추상대수학I": 2,
"창의융합특강XIV/추상대수학II": 2, 
"창의융합특강XII/데이터와인공지능": 2,
"창의융합특강XXII/화학문제해결을위한파이썬활용": 2, 
"창의융합특강IV/최신화학연구논문읽기": 2,
"창의융합특강XVIII/최신화학연구논문읽기": 2, 
"창의융합특강VII/파이썬분석화학": 2,
"창의융합특강XXIII/파이썬분석화학": 2, 
"창의융합특강X/분자분광학실습": 2,
"창의융합특강IX/광학광물학실습": 2,
"창의융합특강XIII/수학논문작성실습": 2,
"창의융합특강XVII/화학논문작성실습": 2, 
"창의융합특강XV/오토마타": 2, 
"창의융합특강XIX/생물정보학과파이썬": 2, 
"창의융합특강XX/ArtwithCode": 2, 
"창의융합특강XVI/유기분광학과구조결정": 2, 
"양자정보특강Ⅰ/양자계산": 2, 
"양자정보특강Ⅱ": 2, 
"양자정보특강Ⅲ": 2, 
"양자정보특강Ⅳ": 2 
})


hours_dict.update({
"양자정보특강I/양자계산": 2,
"창의융합특강I/위상수학과곡면": 2,
"창의융합특강II/다체론": 2,
"창의융합특강III/전산물리학": 2,
"창의융합특강IX/광학광물학실습": 2,
"창의융합특강V/추상대수학I": 2,
"창의융합특강VI/고체물리": 2,
"창의융합특강VIII/분자건축": 2,
"창의융합특강X/분자분광학실습": 2,
"창의융합특강XII/데이터와인공지능": 2,
"창의융합특강XIII/수학논문작성실습": 2,
"창의융합특강XIV/추상대수학II": 2,
"창의융합특강XIX/생물정보학과파이썬": 2,
"창의융합특강XV/오토마타": 2,
"창의융합특강XVI/유기분광학과구조결정": 2,
"창의융합특강XVII/화학논문작성실습": 2,
"창의융합특강XVIII/최신화학연구논문읽기": 2,
"창의융합특강XX/ArtwithCode": 2,
"창의융합특강XXI/UnityGameProgramming": 2,
"창의융합특강XXII/화학문제해결을위한파이썬활용": 2,
"창의융합특강XXIII/파이썬분석화학": 2,
"창의융합특강XXIV/과학사": 2,
"창의융합특강XXV/과학철학": 2,
"로봇공학기초실습I": 2,
"로봇공학기초실습II": 2,
"고급프로그래밍": 2,
"물리학실험": 2,
"고급물리학실험": 2,
"생명과학실험": 2,
"고급생명과학실험": 2,
"화학실험": 2,
"고급화학실험": 2,
"지구과학실험": 2,
"고급지구과학실험": 2,
})

hours_dict.update({
"국어I": 3, 
"국어II": 3,
"물리학I": 4,
"화학II": 4,
"컴퓨터과학I": 3,
})



ordered_group = [
"국어",
"사회",
"영어",
"외국어",
"수학",
"수학정보",
"융합",
"공통",
"물리",
"화학",
"생물",
"지구과학",
"정보",
"미술",
"예체능",
"보건상담" ]





subject_group_dict = {
"객체지향프로그래밍": "정보",
"건강과체육I": "예체능",
"건강과체육II": "예체능",
"경영학": "사회",
"경제학": "사회",
"고급물리학I": "물리",
"고급물리학II": "물리",
"고급생명과학I": "생물",
"고급생명과학II": "생물",
"고급지구과학": "지구과학",
"고급커뮤니케이션": "영어",
"고급화학I": "화학",
"고급화학II": "화학",
"고전문학": "국어",
"과학사": "융합",
"국어I": "국어",
"국어II": "국어",
"기초통계학": "수학",
"독서I": "국어",
"독서II": "국어",
"독서III": "국어",
"독서IV": "국어",
"디자인": "미술",
"매체언어비평": "국어",
"문법": "국어",
"물리학I": "물리",
"물리학II": "물리",
"물리학III": "물리",
"물리학IV": "물리",
"물리학실험I": "물리",
"물리학실험II": "물리",
"미술I": "예체능",
"미술II": "예체능",
"미적분학I": "수학",
"미적분학II": "수학",
"보건/진로": "보건상담",
"생명과학I": "생물",
"생명과학II": "생물",
"생명과학III": "생물",
"생명과학IV": "생물",
"생명과학실험I": "생물",
"생명과학실험II": "생물",
"생활미술": "예체능",
"생활음악": "예체능",
"생활체육": "예체능",
"선형대수학": "수학",
"세계문화지리": "사회",
"세계사": "사회",
"수리정보탐구": "수학정보",
"수학I": "수학",
"수학II": "수학",
"수학III": "수학",
"수학IV": "수학",
"시사영어": "영어",
"여가와체육I": "예체능",
"여가와체육II": "예체능",
"영미문화탐구": "영어",
"영어I": "영어",
"영어II": "영어",
"영어III": "영어",
"영어독해": "영어",
"영어회화I": "영어",
"영어회화II": "영어",
"영작문": "영어",
"예술사": "예체능",
"융합과학": "과학공통",
"융합과학탐구": "과학공통",
"음악I": "예체능",
"음악II": "예체능",
"자료구조": "정보",
"작문": "국어",
"정수론": "수학",
"정치경제": "사회",
"정치와법": "사회",
"중국어I": "외국어",
"중국어II": "외국어",
"지구과학I": "지구과학",
"지구과학II": "지구과학",
"지구과학III": "지구과학",
"창의융합특강1": "융합",
"창의융합특강2": "융합",
"창의융합특강3": "융합",
"창의융합특강4": "융합",
"창의융합특강5": "융합",
"창의융합특강6": "융합",
"창의융합특강7": "융합",
"창의융합특강8": "융합",
"창의융합특강9": "융합",
"창의융합특강10": "융합",
"창의융합특강11": "융합",
"창의융합특강12": "융합",
"창의융합특강I": "융합",
"창의융합특강II": "융합",
"창의융합특강III": "융합",
"창의융합특강IV": "융합",
"창의융합특강V": "융합",
"창의융합특강VI": "융합",
"창의융합특강VII": "융합",
"창의융합특강VIII": "융합",
"창의융합특강IX": "융합",
"창의융합특강X": "융합",
"창의융합특강XI": "융합",
"창의융합특강XII": "융합",
"창의융합특강25": "융합",
"창의융합특강26": "융합",
"창의융합특강27": "융합",
"창의융합특강28": "융합",
"창의융합특강29": "융합",
"창의융합특강30": "융합",
"창의융합특강31": "융합",
"창의융합특강32": "융합",
"창의융합특강33": "융합",
"창의융합특강34": "융합",
"철학": "사회",
"커뮤니케이션": "영어",
"컴퓨터과학I": "정보",
"컴퓨터과학II": "정보",
"한국사": "사회",
"현대문학": "국어",
"화학I": "화학",
"화학II": "화학",
"화학III": "화학",
"화학IV": "화학",
"화학실험I": "화학",
"화학실험II": "화학", 
"창의융합특강VIII/수치해석탐구": "융합",
"창의융합특강XI/양자계산": "융합",
"창의융합특강IV/일반상대성이론": "융합",
"창의융합특강IV/수학논문작성법": "융합",
"창의융합특강I/위상수학과곡면": "융합",
"창의융합특강II/다체론": "융합",
"창의융합특강V/UnityGameProgramming": "융합",
"창의융합특강VI/고체물리": "융합",
"창의융합특강VIII/Click-Clack-Chemistry": "융합",
"창의융합특강VIII/분자건축": "융합",
"창의융합특강VIII/분자건축": "융합", 
"창의융합특강V/추상대수학I": "융합",
"창의융합특강XIV/추상대수학II": "융합", 
"창의융합특강XII/데이터와인공지능": "융합",
"창의융합특강XXII/화학문제해결을위한파이썬활용": "융합", 
"창의융합특강IV/최신화학연구논문읽기": "융합",
"창의융합특강XVIII/최신화학연구논문읽기": "융합", 
"창의융합특강VII/파이썬분석화학": "융합",
"창의융합특강XXIII/파이썬분석화학": "융합", 
"창의융합특강X/분자분광학실습": "융합",
"창의융합특강IX/광학광물학실습": "융합",
"창의융합특강XIII/수학논문작성실습": "융합",
"창의융합특강XVII/화학논문작성실습": "융합", 
"창의융합특강XV/오토마타": "융합", 
"창의융합특강XIX/생물정보학과파이썬": "융합", 
"창의융합특강XX/ArtwithCode": "융합", 
"창의융합특강XVI/유기분광학과구조결정": "융합", 
"양자정보특강Ⅰ/양자계산": "융합", 
"양자정보특강Ⅱ": "융합", 
"양자정보특강Ⅲ": "융합", 
"양자정보특강Ⅳ": "융합", 
"영어소설":  "영어", 
"천문학실습": "지구과학", 
"로봇공학기초실습": "물리",
"컴퓨터과학프로젝트": "정보", 
"양자정보특강I": "융합",
"창의융합연구I": "융합",
"창의융합연구II": "융합",
}


subject_group_dict.update({
"양자정보특강I/양자계산": "수학",
"창의융합특강I/위상수학과곡면": "수학",
"창의융합특강II/다체론": "물리",
"창의융합특강III/전산물리학": "물리",
"창의융합특강IX/광학광물학실습": "지구과학",
"창의융합특강V/추상대수학I": "수학",
"창의융합특강VI/고체물리": "물리",
"창의융합특강VIII/분자건축": "화학",
"창의융합특강X/분자분광학실습": "화학",
"창의융합특강XII/데이터와인공지능": "정보",
"창의융합특강XIII/수학논문작성실습": "수학",
"창의융합특강XIV/추상대수학II": "수학",
"창의융합특강XIX/생물정보학과파이썬": "생물",
"창의융합특강XV/오토마타": "수학",
"창의융합특강XVI/유기분광학과구조결정": "화학",
"창의융합특강XVII/화학논문작성실습": "화학",
"창의융합특강XVIII/최신화학연구논문읽기": "화학",
"창의융합특강XX/ArtwithCode": "정보",
"창의융합특강XXI/UnityGameProgramming": "정보",
"창의융합특강XXII/화학문제해결을위한파이썬활용": "화학",
"창의융합특강XXIII/파이썬분석화학": "화학",
"창의융합특강XXIV/과학사": "지구과학",
"창의융합특강XXV/과학철학": "물리",
'창의융합특강XVI/유기분광학과': "화학", 
'고급지구과학I': "지구과학",
'고급지구과학II': "지구과학",
"로봇공학기초실습I": "물리",
"로봇공학기초실습II": "정보",
"고급프로그래밍": "정보",
"인공지능": "정보",
"물리학실험": "물리",
"고급물리학실험": "물리",
"양자역학": "물리",
"생명과학실험": "생물",
"고급생명과학실험": "생물",
"화학실험": "화학",
"고급화학실험": "화학",
"지구과학실험": "지구과학",
"고급지구과학실험": "지구과학",
"세계사특강": "사회",
})





ordered_subjects = re.split(r'\s+', 
'''창의융합특강VI/고체물리
창의융합특강X/분자분광학실습
고급물리학II
고급생명과학II
양자정보특강I/양자계산
화학실험
창의융합특강VIII/분자건축
영어독해
물리학실험I
미적분학I
창의융합특강XVIII/최신화학연구논문읽기
천문학실습
현대문학
지구과학III
물리학실험
생활미술
생활음악
고급물리학I
창의융합특강XXV/과학철학
창의융합특강V/추상대수학I
고급화학II
세계사
로봇공학기초실습I
정수론
생활체육
자료구조
창의융합특강XII/데이터와인공지능
컴퓨터과학프로젝트
창의융합특강XXIV/과학사
영작문
매체언어비평
영어소설
경제학
미적분학II
한국사
철학
커뮤니케이션
선형대수학
화학실험I
기초통계학
생명과학실험I
작문
물리학III
지구과학II
건강과체육I
국어I
독서III
물리학I
미술I
생명과학I
생명과학III
수학I
수학III
여가와체육I
영어I
영어회화I
융합과학탐구
음악I
중국어I
컴퓨터과학I
화학I
화학III 
부장회의
육아시간''')








s_subjs = re.split(r'\s+', 
'''고급물리학II
고급생명과학II
고급화학II
로봇공학기초실습I
매체언어비평
물리학실험I
미적분학I
미적분학II
생명과학실험I
생활음악
생활체육
선형대수학
세계사
양자정보특강I/양자계산
영어독해
영어소설
영작문
자료구조
정수론
지구과학III
창의융합특강VI/고체물리
창의융합특강VIII/분자건축
창의융합특강X/분자분광학실습
창의융합특강XII/데이터와인공지능
창의융합특강XXV/과학철학
천문학실습
현대문학
화학실험I''')




s_majors =  re.split(r'\s+', 
'''기초통계학
독서III
물리학III
수학III
여가와체육I
음악I
중국어I
지구과학II
화학III''')


s_opts = re.split(r'\s+', 
'''경제학
커뮤니케이션
철학
한국사''')



subjects_by_department = re.split(r'\s+', 
'''국어I
독서III
매체언어비평
작문
현대문학
경제학
세계사
철학
한국사
영어I
영어독해
영어소설
영어회화I
영작문
커뮤니케이션
중국어I
기초통계학
미적분학I
미적분학II
선형대수학
수학I
수학III
양자정보특강I/양자계산
정수론
창의융합특강V/추상대수학I
창의융합특강XXV/과학철학
융합과학탐구
고급물리학I
고급물리학II
로봇공학기초실습I
물리학I
물리학III
물리학실험
물리학실험I
창의융합특강VI/고체물리
고급화학II
창의융합특강VIII/분자건축
창의융합특강X/분자분광학실습
창의융합특강XVIII/최신화학연구논문읽기
화학I
화학III
화학실험
화학실험I
고급생명과학II
생명과학I
생명과학III
생명과학실험I
지구과학II
지구과학III
창의융합특강XXIV/과학사
천문학실습
자료구조
창의융합특강XII/데이터와인공지능
컴퓨터과학I
컴퓨터과학프로젝트
건강과체육I
미술I
생활미술
생활음악
생활체육
여가와체육I
음악I''')




double_name_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''2103김동현 2103김동현A
2602김동현 2602김동현B
2104김민준 2104김민준A
2502김민준 2502김민준B
1109이원재 1109이원재A
1312이원재 1312이원재B
2713이준혁 2713이준혁A
2414이준혁 2414이준혁B
1313이지후 1313이지후A
1412이지후 1412이지후B
1413정유찬 1413정유찬A
1112정유찬 1112정유찬B''' ), 2) )

junior_names = re.split(r'\s+', 
'''1101김민재B
1102김상진
1103김승언
1104김지우
1105박지후
1106백민석
1107신채은
1108양연우
1109윤재원
1110이승우
1111이윤재
1112이주현
1113이채운
1114이태모
1115조민
1116홍정우
1201권우재
1202김찬영
1203남규영
1204류상윤
1205문지우
1206박상수
1207박상훈
1208서동주
1209안채웅
1210양현진
1211이진헌
1212임지윤
1213정용주
1214최주은
1215최현서
1216홍석주
1301김남혁
1302김민재A
1303김민준
1304김용주
1305김우진
1306김주혁
1307남하윤
1308양윤협
1309이규화
1310이승헌
1311이윤수
1312이재현
1313정준우
1314주형조
1315채시완
1316황성연
1317황지훈
1401김도현
1402김민건
1403김재희
1404김채준
1405나경수
1406남현석
1407박주민
1408안재민
1409양찬영
1410이준수
1411장서호
1412정유찬
1413조용우
1414좌희주
1415최도윤
1416허준희
1501고민재
1502구자현
1503김동건
1504김승훈
1505류세현
1506신현우
1507안준혁
1508이성민
1509이시온
1510이예훈
1511이정엽
1512조승민
1513조항현
1514진영범
1515최진혁
1516현승민
1601공윤수
1602김가온
1603김건호
1604김진우
1605박준범
1606서동환
1607양태훈
1608윤영우
1609이민준
1610이연우
1611이한경
1612임해서
1613정성민
1614최지연
1615최현우
1616홍석현
1701고종환
1702구동현
1703김도훈
1704김성훈
1705김세훈
1706김승원
1707김어진
1708김유현
1709문주하
1710박수민
1711석정우
1712선여준
1713유승곤
1714이승현
1715이호찬
1716정다현
1801구준우
1802권지호
1803김도윤
1804김솔엽
1805김우경
1806신믿음
1807유승빈
1808이동원
1809이민섭
1810이준우
1811이태윤
1812이호진
1813정민건
1814최건
1815최은호
1816하윤성
1817함우주''')



include_dict = {}



excludes_dict = {}

exception_list = map(tuple, list_util.partition( 
re.split(r'\s+', 
'''조현태t 육아시간_1$8
김연희t 육아시간_5$5
지우영t 육아시간_1$5
지우영t 육아시간_1$6
지우영t 육아시간_1$9
지우영t 육아시간_1$10
컴퓨터실1조교t 컴퓨터과학I_2$3
체육관조교t 생활체육_1$1
체육관조교t 생활체육_1$2'''
),2))



neis_ordered_subjects = re.split(r'\s+', 
'''건강과체육II
과제연구II
국어II
독서II
물리학II
미술II
보건/진로
생명과학II
세계문화지리
수학II
영어II
영어회화II
융합과학
자연탐사
정치경제
컴퓨터과학II
화학II
R&EII
객체지향프로그래밍
고급물리학I
고급물리학II
고급생명과학I
고급생명과학II
고급화학I
고급화학II
고전문학
과제연구IV
과학사
기초통계학
독서IV
문법
물리학IV
물리학실험II
미적분학I
생명과학IV
생명과학실험II
수리정보탐구
수학IV
시사영어
여가와체육II
영미문화탐구
영어독해
음악II
이공계체험학습
정수론
중국어II
지구과학II
철학
커뮤니케이션
한국사
현대문학
화학IV
화학실험II
고급지구과학
매체언어비평
미적분학II
생활체육
선형대수학
세계사
예술사
졸업논문II
지구과학III''' )





max_subjects_dict = { 20 : ["세계사"], 18 : [] }

min_subjects_dict = { 10 : ["세계사"], 11 : [] }


#eight_h_subjects = re.split(r'\s+',
#'''여가와체육I
#여가와체육II''')


#one_teacher_subjects = re.split(r'\s+', 
#'''음악I
#음악II
#중국어I
#중국어II''')


junior_switch_subjects = re.split(r'\s+', 
'''정치와법
세계문화지리''')

sophomore_switch_subjects = re.split(r'\s+', 
'''한국사
철학
경제학
커뮤니케이션''')





num_sophomores = 127
num_juniors = 129


version_check_pattern = r"수강신청 계획서\(2022학년도 2학기.*\) 2022-05-15"

pre_junior_names = re.split(r'\s+', 
'''0101송삼임
0102송륙을
0103송구기
0104송일계
0105송사병
0106송칠경
0107송열은
0108송이정
0109송오신
0110강팔갑
0111강공무
0112강삼임
0113강륙을
0114강구기
0115강일계
0116강사병
0201차삼을
0202차륙기
0203차구계
0204차일병
0205차사경
0206차칠은
0207차열정
0208차이신
0209차오갑
0210송팔무
0211송공임
0212송삼을
0213송륙기
0214송구계
0215송일병
0216송사경
0301김삼기
0302김륙계
0303김구병
0304김일경
0305김사은
0306김칠정
0307김열신
0308김이갑
0309김오무
0310차팔임
0311차공을
0312차삼기
0313차륙계
0314차구병
0315차일경
0316차사은
0401이삼계
0402이륙병
0403이구경
0404이일은
0405이사정
0406이칠신
0407이열갑
0408이이무
0409이오임
0410김팔을
0411김공기
0412김삼계
0413김륙병
0414김구경
0415김일은
0501한삼병
0502한륙경
0503한구은
0504한일정
0505한사신
0506한칠갑
0507한열무
0508한이임
0509한오을
0510이팔기
0511이공계
0512이삼병
0513이륙경
0514이구은
0515이일정
0516이사신
0601민삼경
0602민륙은
0603민구정
0604민일신
0605민사갑
0606민칠무
0607민열임
0608민이을
0609민오기
0610한팔계
0611한공병
0612한삼경
0613한륙은
0614한구정
0615한일신
0616한사갑
0701장삼은
0702장륙정
0703장구신
0704장일갑
0705장사무
0706장칠임
0707장열을
0708장이기
0709장오계
0710민팔병
0711민공경
0712민삼은
0713민륙정
0714민구신
0715민일갑
0716민사무
0801홍삼정
0802홍륙신
0803홍구갑
0804홍일무
0805홍사임
0806홍칠을
0807홍열기
0808홍이계
0809홍오병
0810장팔경
0811장공은
0812장삼정
0813장륙신
0814장구갑
0815장일무
0816장사임
0317강일칠
0416김일륙
0817송팔칠''')


def is_spring_semester() : 
    if semester_prefix.endswith("1_") : 
        return True 
    else : 
        return False


def is_next_spring_semester() : 
    if next_semester_prefix.endswith("1_") : 
        return True 
    else : 
        return False




five_eight_spring_subj = "세계문화지리" 
one_four_spring_subj = "정치와법"

one_four_spring_soph = "한국사" 
five_eight_spring_soph = "철학"



fixed_slots = {
"부장회의_1$1": "목2", 
"육아시간_1$1": "월1", 
"육아시간_1$2": "월2", 
"육아시간_1$3": "화1", 
"육아시간_1$4": "화2", 
"육아시간_1$5": "수1", 
"육아시간_1$6": "수2", 
"육아시간_1$7": "목1", 
"육아시간_1$8": "목2", 
"육아시간_1$9": "금1", 
"육아시간_1$10": "금2", 
"육아시간_2$1": "월6", 
"육아시간_2$2": "화6", 
"육아시간_2$3": "화7", 
"육아시간_2$4": "목6", 
"육아시간_2$5": "금6", 
"육아시간_2$6": "목7", 
}



exclusion_class_names = [
#[ "문법_6 문법_7 문법_8 문법_9 문법_10".split(), 
#re.split(r'\s+', 
#'''2101강동우 2103김동현A 2104김민준A 2107노세현 2108박경원 2111이윤서 2114임상우 2115조성길 2202김남진 2203김대순 2205김석환 2207박지형 2208서지민 2209송경민 2210양준혁 2211오태인 2212유지민 2213육민수 2214이재용 2215이현서 2305박진수 2306박찬우 2308여현준 2309유현우 2310윤동규 2311이재효 2312이호준 2313정우진 2315홍경찬 2401고도영 2406문성빈 2407문승현 2409송우석 2411안도현 2413안호중 2414이준혁B 2415정정훈 2417함주현 2502김민준B 2503김찬우 2505문수혁 2506박제하 2507심준선 2508이성민 2510이채운 2511정시우 2512정재원 2513정진교 2514조석희 2515최건 2601김동규 2602김동현B 2603김용재 2607박정우 2609송민혁 2612이서준 2614장윤성 2615차원재 2616한서준 2701구현모 2705김지환 2706김현준 2713이준혁A 2714이지후 2801강현후 2804서한결 2805손지훈 2807신다윤 2809장현서 2811정찬우 2812한상우 2813홍휘택 2815황태훈''' 
#) ], 
#[ "문법_1 문법_2 문법_3 문법_4 문법_5".split(), 
#re.split(r'\s+', 
#'''3102김동우 3105서민석 3106송석원 3107심재진 3109이대준 3111이수민 3114최혁 3202김범준 3203김선우 3204김태민 3205김태윤C 3206박상연 3208박수현 3210유동주 3212이준혁 3215황보현 3216황성빈 3301강현 3302김정현 3304김태윤A 3307백우준 3308백인규 3309서유완 3310손현준 3311유정인 3312윤민식 3313이은재 3314이진환 3315전상욱 3401강태연 3402구홍진 3403기현민 3410심규성 3411위현복 3412이남욱 3413이호준 3414최원준 3502김민재 3503김원일 3504김태윤D 3505김형환 3506김호준 3507변수현 3508변준섭 3509우상엽 3510이기석 3512장근영 3513조용성 3514차지명 3601권혁 3602김경민 3603김민성 3605박재훈 3606신희제 3607오유준 3608오태현 3611조민범 3612조민재 3614최준서 3615한지훈 3616허은수 3702김준서 3704문재현 3705박지우 3706박태원 3708오재석 3710전혁주 3711조경아 3713최우진 3714한정민 3715황혜준 3801김승엽 3802김신건 3804김현우 3806박병모 3808신해인 3811정승민 3812조민성 3814최동민 3815최서현 3816황두환''' 
#) ]
 ]


def exclude_classes_of(st_name, across = False) : 
    output = [ ] 
    for class_list, name_list in exclusion_class_names : 
        if st_name in name_list : 
            if not across : 
                output.extend(class_list)
    return output

def exclude_names_of(clss, across = False) : 
    output = [ ] 
    for class_list, name_list in exclusion_class_names : 
        if clss in class_list : 
            if not across : 
                output.extend(name_list)
    return list_util.union(output)





def load_exclusions( filename = "exclusions.semp" ) :
    with open( filename ) as f :
        print("Loading " + filename)
        loaded_excls = pickle.load( open(filename, "rb") )
        for pair in loaded_excls : 
            #print "Exclusion for <%s> is loaded." % ' '.join(pair[0])
            print("Exclusion for <{}> is loaded." % ' '.join(pair[0]))
        exclusion_class_names.extend(loaded_excls)



subject_nums_dict = {
"화학실험I": [3,3,3,2], 
"물리학실험I": [3,3,4],
"기초통계학": [3,3,3],
"독서III": [3,3,3],
"수학III": [3,3,3],
"지구과학I": [3,3,3],
"물리학III": [3,3,2],
"여가와체육I": [3,3,2],
"화학III": [3,3,2],
"영어독해": [2,2,3],
"음악I": [2,2,3],
"중국어I": [2,2,3],
"선형대수학": [3,3],
"작문": [3,3]}


def is_senior(st_name) : 
    if st_name.startswith("2") : 
        return True
    else : 
        return False




def hour_sum_formula(ind) : 
    column_letter = openpyxl.utils.get_column_letter( int(ind) + 2 )
    output = ('=COUNTA({}7:{}42) - SUMPRODUCT(--(ISNUMBER(FIND("융합과학탐구",  {}7:{}42 )))) * 0.5' + \
                ' - SUMPRODUCT(--(ISNUMBER(FIND("예술사",  {}7:{}42 )))) * 0.5' ).format(
                 column_letter, column_letter, column_letter, column_letter, column_letter, column_letter, 
                         column_letter, column_letter)
    output = '=0'
    return output









special_lecture_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''양자계산 창의융합특강11
고체물리 창의융합특강6 
수학논문작성법 창의융합특강4
Click-Clack-Chemistry 창의융합특강8
데이터와인공지능 창의융합특강12'''), 2) )







special_lecture_isupyo_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''창의융합특강11 창의융합특강XI
창의융합특강13 창의융합특강IV
창의융합특강8 창의융합특강VIII
창의융합특강9 창의융합특강IX
창의융합특강10 창의융합특강X
창의융합특강1 창의융합특강I
창의융합특강3 창의융합특강III
창의융합특강6 창의융합특강VI
창의융합특강7 창의융합특강VII'''), 2) )

alternating_part_pairs =  list_util.partition( 
re.split(r'\s+', 
'''융합과학탐구_1$1 융합과학탐구_5$1
융합과학탐구_1$2 융합과학탐구_5$2
융합과학탐구_1$3 융합과학탐구_5$3
융합과학탐구_2$1 융합과학탐구_6$1
융합과학탐구_2$2 융합과학탐구_6$2
융합과학탐구_2$3 융합과학탐구_6$3
융합과학탐구_3$1 융합과학탐구_7$1
융합과학탐구_3$2 융합과학탐구_7$2
융합과학탐구_3$3 융합과학탐구_7$3
융합과학탐구_4$1 융합과학탐구_8$1
융합과학탐구_4$2 융합과학탐구_8$2
융합과학탐구_4$3 융합과학탐구_8$3
융합과학탐구_5$1 융합과학탐구_1$1
융합과학탐구_5$2 융합과학탐구_1$2
융합과학탐구_5$3 융합과학탐구_1$3
융합과학탐구_6$1 융합과학탐구_2$1
융합과학탐구_6$2 융합과학탐구_2$2
융합과학탐구_6$3 융합과학탐구_2$3
융합과학탐구_7$1 융합과학탐구_3$1
융합과학탐구_7$2 융합과학탐구_3$2
융합과학탐구_7$3 융합과학탐구_3$3
융합과학탐구_8$1 융합과학탐구_4$1
융합과학탐구_8$2 융합과학탐구_4$2
융합과학탐구_8$3 융합과학탐구_4$3
생활체육_1$1 생활체육_2$1
생활체육_1$2 생활체육_2$2
생활체육_2$1 생활체육_1$1
생활체육_2$2 생활체육_1$2'''), 2)

slot_sharing_part_dict = { }
for part_one, part_two in alternating_part_pairs : 
    slot_sharing_part_dict[part_one] = part_two

default_name_classroom_dict =  dict( list_util.partition( 
re.split(r'\s+', 
'''조영혜t 국어강의실1
조미연t 우암공통강의실1 
조동근t 사회강의실1
허진미t 사회강의실2 
김경훈t 우암공통강의실3 
황광원t 사회강의실3
공윤주t 외국어강의실1 
신수진t 외국어강의실3 
이미영t 외국어강의실2 
정유선t 외국어강의실4 
박은서t 우암공통강의실2 
송원택t 우암공통강의실4 
변은지t 음악실 
송경수t 체육관 
김대범t 체육관 
정유정t 미술실'''), 2))





class_part_merge_dict  = {
"생활체육_1$1 생활체육_2$1": "생활체육_1,2$1", 
"생활체육_1$2 생활체육_2$2": "생활체육_1,2$2", 
"융합과학탐구_1$1 융합과학탐구_5$1": "융합과학탐구_1,5$1", 
"융합과학탐구_1$2 융합과학탐구_5$2": "융합과학탐구_1,5$2", 
"융합과학탐구_1$3 융합과학탐구_5$3": "융합과학탐구_1,5$3", 
"융합과학탐구_2$1 융합과학탐구_6$1": "융합과학탐구_2,6$1", 
"융합과학탐구_2$2 융합과학탐구_6$2": "융합과학탐구_2,6$2", 
"융합과학탐구_2$3 융합과학탐구_6$3": "융합과학탐구_2,6$3", 
"융합과학탐구_3$1 융합과학탐구_7$1": "융합과학탐구_3,7$1", 
"융합과학탐구_3$2 융합과학탐구_7$2": "융합과학탐구_3,7$2", 
"융합과학탐구_3$3 융합과학탐구_7$3": "융합과학탐구_3,7$3", 
"융합과학탐구_4$1 융합과학탐구_8$1": "융합과학탐구_4,8$1", 
"융합과학탐구_4$2 융합과학탐구_8$2": "융합과학탐구_4,8$2", 
"융합과학탐구_4$3 융합과학탐구_8$3": "융합과학탐구_4,8$3", 
}

def part_merge(parts_str) :  
    if parts_str in class_part_merge_dict : 
        return class_part_merge_dict[parts_str] 
    else : 
        return parts_str
        
sci_depts = "정보 수학 물리 지구과학 화학 생물".split()  
def is_in_sci_dept(my_name) : 
    if my_name not in name_department_dict : 
        return False
    elif name_department_dict[my_name] not in sci_depts : 
        return False
    else : 
        return True


last_name_conv = dict( list_util.partition( 
re.split(r'\s+', 
'''강 kang
고 ko
공 kong
곽 kwag
구 koo
권 kwon
기 ki
김 kim
남 nahm
노 noh
모 mo
문 moon
민 min
박 park
배 bae
백 baek
변 pyeon
서 seo
손 sohn
송 song
신 shin
심 sim
안 ahn
양 yang
엄 uhm
오 oh
옥 ohk
왕 wang
우 woo
위 wi
유 yoo
윤 yoon
이 lee
임 yim
장 jang
전 jeon
정 jeong
조 cho
주 joo
지 ji
진 jin
차 cha
채 chae
천 cheon
최 choi
추 choo
한 han
허 heo
현 hyun
호 ho
홍 hong
황 hwang'''),2))

given_name_conv = dict( list_util.partition( 
re.split(r'\s+', 
'''가 k
강 k
건 k
겸 k
경 k
관 k
구 k
권 k
규 k
균 k
근 k
기 k
길 k
나 n
남 n
녕 n
늘 n
다 d
대 d
덕 d
도 d
동 d
두 d
람 r
래 r
렬 r
령 r
명 m
모 m
목 m
무 m
민 m
반 b
범 b
병 b
보 b
복 b
비 b
빈 b
상 s
서 s
석 s
선 s
섭 s
성 s
세 s
소 s
솜 s
수 s
순 s
승 s
시 s
식 s
신 s
아 a
애 a
어 e
연 y
엽 y
영 y
예 y
오 o
완 o
용 y
우 w
욱 u
운 u
웅 u
원 w
유 y
윤 y
은 e
의 y
이 i
익 i
인 i
일 i
재 j
정 j
제 j
종 j
주 j
준 j
중 j
지 j
진 j
찬 c
창 c
채 c
철 c
치 c
태 c
하 h
한 h
해 h
헌 h
혁 h
현 h
형 h
혜 h
호 h
홍 h
환 h
회 h
효 h
후 h
훈 h
휘 h
희 h'''),2))






try: 
    st_info_tuples 
except NameError: 
    st_info_tuples = [ ]
    phone_dict = { }

save_filename = "phone_numbers.p"
def save(save_filename = save_filename) :
    gen_util.leave_a_backup( save_filename )
    with open( save_filename, "wb" ) as f :
        print("Writing table to <{}> ".format(save_filename))
        pickle.dump( [st_info_tuples, phone_dict ], f)

def load(filename = save_filename) :
    global st_info_tuples, phone_dict 
    with open(filename) as f : 
        print("Loading " + filename)
        st_info_tuples, phone_dict \
                = pickle.load( open(filename, "rb") )
        print("{} has {} items".format("st_info_tuples", len(st_info_tuples)))
        print("{} has {} items".format("phone_dict", len(phone_dict)))

def update_phone_dict(filename) : 
    raw_data = xlsx_util.read_xlsx_sheet_into_list(filename)
    data = [rec for rec in raw_data if re.search(r'\d{5}', rec[0])]
    global st_info_tuples 
    print("Updating st_info_tuples..")
    st_info_tuples = [ ( rec[1]+rec[2], rec[3], rec[0], rec[4] ) 
        for rec in data ]
    print(' '.join(st_info_tuples[0]))
    print('...')
    print('...')
    print(' '.join(st_info_tuples[-1]))
    print("{} tuples in total ".format(len(st_info_tuples)))
    print("Updating phone_dict")
    for rec in st_info_tuples :
        st_name = rec[0] 
        phn_num = rec[3]
        if st_name not in phone_dict : 
            phone_dict[st_name] = phn_num
            print("Adding {} : {}".format(st_name, phn_num))
        else : 
            if phone_dict[st_name] != phn_num : 
                #print "Updating %s : %s -> %s" % (st_name, phone_dict[st_name], phn_num)
                print("Updating {} : {} -> {}".format(st_name,
                        phone_dict[st_name], phn_num))
                phone_dict[st_name] = phn_num
    print("All Done")

    

def update_teacher_phone_dict(filename) : 
    raw_data = xlsx_util.read_xlsx_sheet_into_list(filename)
    data = [rec for rec in raw_data if re.search(r'\d{4}', rec[3])]
    print("Updating phone_dict")
    for rec in data :
        t_name = rec[0]  + "t"
        phn_num = rec[3]
        if t_name not in phone_dict : 
            phone_dict[t_name] = phn_num
            print("Adding {} : {}".format(t_name, phn_num))
        else : 
            if phone_dict[t_name] != phn_num : 
                print("Updating {} : {} -> {}".format(t_name,
                        phone_dict[t_name], phn_num))
                phone_dict[t_name] = phn_num
    print("All Done")

def export_sshs_contacts(xlsx_filename, txt_filename, only_current = True):
    raw_data = xlsx_util.read_xlsx_sheet_into_list(xlsx_filename)
    data = [rec for rec in raw_data if re.search(r'\d{4}', rec[3])]
    output = [ ] 
    for rec in data :
        t_name = rec[0]  
        phn_num = rec[3]
        if len(rec[8]) == 0 : 
            if only_current : 
                continue
            else : 
                int_phn = "" 
        else : 
            int_phn = "02-740-6" + rec[8]  
        output.append( ' '.join( [ t_name, phn_num, int_phn ] ) )
    output.sort()
    gen_util.write_list_into_txt( txt_filename, output )




special_lecture_formal_dict = dict( list_util.partition( 
re.split(r'\s+', 
'''양자정보특강I 양자정보특강I/양자계산
창의융합특강I 창의융합특강I/위상수학과곡면
창의융합특강II 창의융합특강II/다체론
창의융합특강III 창의융합특강III/전산물리학
창의융합특강IX 창의융합특강IX/광학광물학실습
창의융합특강V 창의융합특강V/추상대수학I
창의융합특강VI 창의융합특강VI/고체물리
창의융합특강VIII 창의융합특강VIII/분자건축
창의융합특강X 창의융합특강X/분자분광학실습
창의융합특강XII 창의융합특강XII/데이터와인공지능
창의융합특강XIII 창의융합특강XIII/수학논문작성실습
창의융합특강XIV 창의융합특강XIV/추상대수학II
창의융합특강XIX 창의융합특강XIX/생물정보학과파이썬
창의융합특강XV 창의융합특강XV/오토마타
창의융합특강XVI 창의융합특강XVI/유기분광학과 구조 결정
창의융합특강XVII 창의융합특강XVII/화학논문작성실습
창의융합특강XVIII 창의융합특강XVIII/최신화학연구논문읽기
창의융합특강XX 창의융합특강XX/ArtwithCode
창의융합특강XXI 창의융합특강XXI/UnityGameProgramming
창의융합특강XXII 창의융합특강XXII/화학문제해결을위한파이썬활용
창의융합특강XXIII 창의융합특강XXIII/파이썬분석화학
창의융합특강XXIV 창의융합특강XXIV/과학사
창의융합특강XXV 창의융합특강XXV/과학철학''' ), 2) )


def convert_function(name_subj_sem ):
    st_name, subj, sem_str = name_subj_sem
    if st_name[0]=="1" and (st_name[1] in "1 2 3 4".split()) and \
        sem_str == '2022_1'  and subj in "한국사 철학".split() : 
            return (st_name, "한국사", sem_str)
    elif st_name[0]=="1" and (st_name[1] in "5 6 7 8".split()) and \
        sem_str == '2022_1'  and subj in "한국사 철학".split() : 
            return (st_name, "철학", sem_str)
    elif st_name[0]=="1" and (st_name[1] in "1 2 3 4".split()) and \
        sem_str == '2022_1'  and subj in "경제학 커뮤니케이션".split() : 
            return (st_name, "경제학", sem_str)
    elif st_name[0]=="1" and (st_name[1] in "5 6 7 8".split()) and \
        sem_str == '2022_1'  and subj in "경제학 커뮤니케이션".split() : 
            return (st_name, "커뮤니케이션", sem_str)
    else : 
        return name_subj_sem
    



classroom_size_bound = {
"상상토의실": 16, 
"컴퓨터실2": 19,
"물리실험실2": 12,
"물리실험실3": 10
}

three_day_subjects = [ ] 

chinese_days = "목 금".split()

all_subjects = re.split(r'\s+', 
'''건강과체육Ⅰ
건강과체육Ⅱ
경제학
고급물리학Ⅰ
고급물리학Ⅱ
고급물리학실험
고급생명과학Ⅰ
고급생명과학Ⅱ
고급생명과학실험
고급지구과학Ⅰ
고급지구과학Ⅱ
고급커뮤니케이션
고급프로그래밍
고급화학Ⅰ
고급화학Ⅱ
고급화학실험
고전문학
국어Ⅰ
국어Ⅱ
기초통계학
독서Ⅰ
독서Ⅱ
독서Ⅲ
독서Ⅳ
디자인
로봇공학기초실습Ⅰ
로봇공학기초실습Ⅱ
매체언어비평
문법
물리학Ⅰ
물리학Ⅱ
물리학Ⅲ
물리학Ⅳ
물리학실험
물리학실험Ⅰ
물리학실험Ⅱ
미술Ⅰ
미술Ⅱ
미적분학Ⅰ
미적분학Ⅱ
생명과학Ⅰ
생명과학Ⅱ
생명과학Ⅲ
생명과학Ⅳ
생명과학실험
생명과학실험Ⅰ
생명과학실험Ⅱ
생활미술
생활음악
생활체육
선형대수학
세계문화지리
세계사
세계사특강
수학Ⅰ
수학Ⅱ
수학Ⅲ
수학Ⅳ
시사영어
양자역학
양자정보특강Ⅰ
양자정보특강Ⅱ
양자정보특강Ⅲ
양자정보특강Ⅳ
여가와체육Ⅰ
여가와체육Ⅱ
영미문화탐구
영어Ⅰ
영어Ⅱ
영어독해
영어소설
영어회화Ⅰ
영어회화Ⅱ
영작문
예술사
융합과학
융합과학탐구
음악Ⅰ
음악Ⅱ
인공지능
자료구조
작문
정수론
정치경제
정치와 법
중국어Ⅰ
중국어Ⅱ
지구과학Ⅰ
지구과학Ⅱ
지구과학Ⅲ
창의융합연구Ⅰ
창의융합연구Ⅱ
천문학실습
철학
커뮤니케이션
컴퓨터과학Ⅰ
컴퓨터과학Ⅱ
컴퓨터과학프로젝트
한국사
현대문학
화학Ⅰ
화학Ⅱ
화학Ⅲ
화학Ⅳ
화학실험
화학실험Ⅰ
화학실험Ⅱ
창의융합특강I
창의융합특강II
창의융합특강III
창의융합특강IV
창의융합특강V
창의융합특강VI
창의융합특강VII
창의융합특강VIII
창의융합특강IX
창의융합특강X
창의융합특강XI
창의융합특강XII
창의융합특강XIII
창의융합특강XIV
창의융합특강XV
창의융합특강XVI
창의융합특강XVII
창의융합특강XVIII
창의융합특강XIX
창의융합특강XX
창의융합특강XXI
창의융합특강XXII
창의융합특강XXIII
창의융합특강XXIV
창의융합특강XXV
창의융합특강XXVI
창의융합특강XXVII
창의융합특강XXVIII
창의융합특강XXIX
창의융합특강XXX
창의융합특강XXXI
창의융합특강XXXII
창의융합특강XXXIII
창의융합특강XXXIV
창의융합특강XXXV
창의융합특강XXXVI
창의융합특강XXXVII
창의융합특강XXXVIII
창의융합특강XXXIX
창의융합특강XL''')


sem_fix_subjects = re.split(r'\s+', 
'''국어Ⅰ
세계문화지리
철학
독서Ⅰ
영어Ⅰ
영어회화Ⅰ
건강과체육Ⅰ
미술Ⅰ
수학Ⅰ
물리학Ⅰ
화학Ⅰ
생명과학Ⅰ
컴퓨터과학Ⅰ
융합과학탐구
국어Ⅱ
독서Ⅱ
영어Ⅱ
영어회화Ⅱ
건강과체육Ⅱ
미술Ⅱ
수학Ⅱ
물리학Ⅱ
화학Ⅱ
생명과학Ⅱ
컴퓨터과학Ⅱ
융합과학
여가와체육Ⅰ
음악Ⅰ
수학Ⅲ
지구과학Ⅰ
독서Ⅲ
중국어Ⅰ
여가와체육Ⅱ
음악Ⅱ
수학Ⅳ
지구과학Ⅱ
독서Ⅳ
중국어Ⅱ''')


teacher_avoid_slots_dict = {
#"조영혜t": "금3 금4 금5 금6 금7".split(), 
"물리실험실1조교t": "월1 월2".split(), 
"물리실험실2조교t": "월1 월2".split(), 
"생물실험실1조교t": "월1 월2".split(), 
"생물실험실2조교t": "월1 월2".split(), 
"화학실험실1조교t": "월1 월2".split(), 
"화학실험실2조교t": "월1 월2".split(), 
}




m_ordered_subjects = re.split(r'\s+', 
'''창의융합특강VI/고체물리
고급물리학II
고급생명과학II
미적분학I
창의융합특강VIII/분자건축
창의융합특강X/분자분광학실습
양자정보특강I/양자계산
영어독해
현대문학
화학실험
창의융합특강XVIII/최신화학연구논문읽기
고급물리학I
창의융합특강XXV/과학철학
고급화학II
창의융합특강V/추상대수학I
물리학실험
물리학실험I
생활미술
생활음악
세계사
정수론
지구과학III
천문학실습
생활체육
창의융합특강XXIV/과학사
로봇공학기초실습I
매체언어비평
자료구조
창의융합특강XII/데이터와인공지능
컴퓨터과학프로젝트
경제학
영어소설
영작문
철학
커뮤니케이션
한국사
미적분학II
선형대수학
기초통계학
건강과체육I
미술I
영어회화I
음악I
중국어I
여가와체육I
독서III
영어I
작문
컴퓨터과학I
국어I
물리학III
생명과학III
생명과학I
수학III
지구과학II
화학I
물리학I
수학I
융합과학탐구
화학III
생명과학실험I
화학실험I''')

single_shorthands = dict( list_util.partition( 
re.split(r'\s+', 
'''문법 문
커뮤 커
물포 물
괗일 괗
화논 환
여체 체
옃이 잋
물실 밀
수포 숲 
지리 질
수투 숱
화투 홭
시영 싱
다체 닻
생포 샢
현문 훤
컴프 프
지능 진
믹일 믹 
고생 곳 
음악 음 
수논 손
영독 엳 
고커 곸 
중어 중 
중이 쥥
생정 샞 
골이 골 
고문 곰 
화실 활 
화포 홮 
분건 분 
독사 독 
수론 순 
지투 짙 
한사 한 
철학 철
객지 객
건체 건
고지 곶
과사 괏
국어 국
독이 딕 
매평 매
물투 뭍
미술 미
믹이 밍
생체 샟
생투 샡
세사 셋
수정 숮 
영미 염 
영어 영
영회 회
예사 옛 
정법 정 
지삼 짓 
지일 지
컴과 컴
컴길 킴
경제 경
골일 길
공이 굉
괗이 굏
국일 귈
기통 깉
독삼 돔
로일 롤
물일 뮐
물삼 뭄
밀일 밇
생일 샐
생삼 샘
생실 싈
생미 싕
생음 슴
선대 선
수일 술
수삼 숨
양산 양
체일 칠
영일 열
영소 엿
영작 역
융탐 탐
음일 읨
자료 자
작문 작
대수 대
고체 고
분광 광 
화연 현
과철 걸
천문 천
화일 횔
화삼 홤
활일 횛'''), 2)) 

single_shorthands["    "] = "  "
single_shorthands["공강"] = "공"


search_sorted  = ordered_subjects 

subject_avg_dict = dict( 
map(lambda x: (x[0], int(x[1])), 
list_util.partition( 
re.split(r'\s+', 
'''건강과체육I 16
경제학 15
고급물리학I 11
고급물리학II 8
고급생명과학II 9
고급화학II 12
국어I 16
기초통계학 17
독서III 16
로봇공학기초실습I 10
매체언어비평 16
물리학I 16
물리학III 16
물리학실험 10
물리학실험I 7
미술I 16
미적분학I 14
미적분학II 16
생명과학I 16
생명과학III 16
생명과학실험I 12
생활미술 10
생활음악 10
생활체육 18
선형대수학 15
세계사 12
수학I 16
수학III 16
양자정보특강I/양자계산 9
여가와체육I 16
영어I 16
영어독해 12
영어소설 15
영어회화I 16
영작문 12
융합과학탐구 16
음악I 16
자료구조 12
작문 16
정수론 15
중국어I 16
지구과학II 16
지구과학III 10
창의융합특강V/추상대수학I 11
창의융합특강VI/고체물리 6
창의융합특강VIII/분자건축 10
창의융합특강X/분자분광학실습 7
창의융합특강XII/데이터와인공지능 12
창의융합특강XVIII/최신화학연구논문읽기 14
창의융합특강XXIV/과학사 14
창의융합특강XXV/과학철학 11
천문학실습 8
철학 16
커뮤니케이션 18
컴퓨터과학I 16
컴퓨터과학프로젝트 14
한국사 15
현대문학 16
화학I 16
화학III 16
화학실험 9
화학실험I 11'''), 2) ))

